OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
/*
 * USB hub driver.
 *
 * (C) Copyright 1999 Linus Torvalds
 * (C) Copyright 1999 Johannes Erdfelt
 * (C) Copyright 1999 Gregory P. Smith
 * (C) Copyright 2001 Brad Hards (bhards@bigpond.net.au)
 *
 */

/**************************************************************************//**
 * @file     hub.c
 * @version  V1.10
 * $Revision: 11 $
 * $Date: 14/10/03 1:54p $
 * @brief  Ported from Linux USB host driver.
 *
 * @note
 * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "M480.h"

#include "usb.h"

/// @cond HIDDEN_SYMBOLS

/* if we are in debug mode, always announce new devices */
#ifdef DEBUG
#ifndef CONFIG_USB_ANNOUNCE_NEW_DEVICES
#define CONFIG_USB_ANNOUNCE_NEW_DEVICES
#endif
#endif

struct usb_hub {
    struct device       *intfdev;   /* the "interface" device */
    struct usb_device   *hdev;
    //struct kref       kref;
    int         kref;
    struct urb      *urb;       /* for interrupt polling pipe */

    /* buffer for urb ... with extra space in case of babble */
    char            (*buffer)[8];
    union {
        struct usb_hub_status   hub;
        struct usb_port_status  port;
    }       *status;    /* buffer for status reports */
    //struct mutex      status_mutex;   /* for the status buffer */

    int         error;      /* last reported error */
    int         nerrors;    /* track consecutive errors */

    struct list_head    event_list; /* hubs w/data or errs ready */
    unsigned long       event_bits[1];  /* status change bitmask */
    unsigned long       change_bits[1]; /* ports with logical connect
                            status change */
    unsigned long       busy_bits[1];   /* ports being reset or
                            resumed */
    unsigned long       removed_bits[1]; /* ports with a "removed"
                            device present */
#if USB_MAXCHILDREN > 31 /* 8*sizeof(unsigned long) - 1 */
#error event_bits[] is too short!
#endif

    struct usb_hub_descriptor *descriptor;  /* class descriptor */
    struct usb_tt       tt;     /* Transaction Translator */

    unsigned        mA_per_port;    /* current for each child */

    unsigned        limited_power:1;
    unsigned        quiescing:1;
    unsigned        disconnected:1;

    unsigned        has_indicators:1;
    u8          indicator[USB_MAXCHILDREN];
    //struct delayed_work   leds;
    //struct delayed_work   init_work;
    void            **port_owners;
};

static inline int hub_is_superspeed(struct usb_device *hdev)
{
    return (hdev->descriptor.bDeviceProtocol == 3);
}

/* Protect struct usb_device->state and ->children members
 * Note: Both are also protected by ->dev.sem, except that ->state can
 * change to USB_STATE_NOTATTACHED even when the semaphore isn't held. */
//static DEFINE_SPINLOCK(device_state_lock);

/* khubd's worklist and its lock */
//static DEFINE_SPINLOCK(hub_event_lock);
static LIST_HEAD(hub_event_list);   /* List of hubs needing servicing */

/* Wakes up khubd */
//static DECLARE_WAIT_QUEUE_HEAD(khubd_wait);

//static struct task_struct *khubd_task;

/* cycle leds on hubs that aren't blinking for attention */
static int blinkenlights = 0;
//module_param (blinkenlights, bool, S_IRUGO);
//MODULE_PARM_DESC (blinkenlights, "true to cycle leds on hubs");

/*
 * Device SATA8000 FW1.0 from DATAST0R Technology Corp requires about
 * 10 seconds to send reply for the initial 64-byte descriptor request.
 */
/* define initial 64-byte descriptor request timeout in milliseconds */
static int initial_descriptor_timeout = USB_CTRL_GET_TIMEOUT;
//module_param(initial_descriptor_timeout, int, S_IRUGO|S_IWUSR);
//MODULE_PARM_DESC(initial_descriptor_timeout,
//      "initial 64-byte descriptor request timeout in milliseconds "
//      "(default 5000 - 5.0 seconds)");

/*
 * As of 2.6.10 we introduce a new USB device initialization scheme which
 * closely resembles the way Windows works.  Hopefully it will be compatible
 * with a wider range of devices than the old scheme.  However some previously
 * working devices may start giving rise to "device not accepting address"
 * errors; if that happens the user can try the old scheme by adjusting the
 * following module parameters.
 *
 * For maximum flexibility there are two boolean parameters to control the
 * hub driver's behavior.  On the first initialization attempt, if the
 * "old_scheme_first" parameter is set then the old scheme will be used,
 * otherwise the new scheme is used.  If that fails and "use_both_schemes"
 * is set, then the driver will make another attempt, using the other scheme.
 */
static int old_scheme_first = 0;
//module_param(old_scheme_first, bool, S_IRUGO | S_IWUSR);
//MODULE_PARM_DESC(old_scheme_first,
//       "start with the old device initialization scheme");

static int use_both_schemes = 1;
//module_param(use_both_schemes, bool, S_IRUGO | S_IWUSR);
//MODULE_PARM_DESC(use_both_schemes,
//      "try the other device initialization scheme if the "
//      "first one fails");

/* Mutual exclusion for EHCI CF initialization.  This interferes with
 * port reset on some companion controllers.
 */
//DECLARE_RWSEM(ehci_cf_port_reset_rwsem);

#define HUB_DEBOUNCE_TIMEOUT    1500
#define HUB_DEBOUNCE_STEP       25
#define HUB_DEBOUNCE_STABLE     100


static int usb_reset_and_verify_device(struct usb_device *udev);

#ifdef DEBUG
static inline char *portspeed(struct usb_hub *hub, int portstatus)
{
    if (hub_is_superspeed(hub->hdev))
        return "5.0 Gb/s";
    if (portstatus & USB_PORT_STAT_HIGH_SPEED)
        return "480 Mb/s";
    else if (portstatus & USB_PORT_STAT_LOW_SPEED)
        return "1.5 Mb/s";
    else
        return "12 Mb/s";
}
#endif

/* Note that hdev or one of its children must be locked! */
static struct usb_hub *hdev_to_hub(struct usb_device *hdev)
{
    if (!hdev || !hdev->actconfig)
        return NULL;
    return usb_get_intfdata(hdev->actconfig->interface[0]);
}

/* USB 2.0 spec Section 11.24.4.5 */
static int get_hub_descriptor(struct usb_device *hdev, void *data)
{
    int i, ret, size;
    unsigned dtype;

    if (hub_is_superspeed(hdev)) {
        dtype = USB_DT_SS_HUB;
        size = USB_DT_SS_HUB_SIZE;
    } else {
        dtype = USB_DT_HUB;
        size = sizeof(struct usb_hub_descriptor);
    }

    for (i = 0; i < 3; i++) {
        ret = usb_control_msg(hdev, usb_rcvctrlpipe(hdev, 0),
                              USB_REQ_GET_DESCRIPTOR, USB_DIR_IN | USB_RT_HUB,
                              dtype << 8, 0, data, size,
                              USB_CTRL_GET_TIMEOUT);
        if (ret >= (USB_DT_HUB_NONVAR_SIZE + 2))
            return ret;
    }
    return -EINVAL;
}

