OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
/*
 * USB 2.0 spec Section 11.24.2.1
 */
static int clear_hub_feature(struct usb_device *hdev, int feature)
{
    return usb_control_msg(hdev, usb_sndctrlpipe(hdev, 0),
                           USB_REQ_CLEAR_FEATURE, USB_RT_HUB, feature, 0, NULL, 0, 1000);
}

/*
 * USB 2.0 spec Section 11.24.2.2
 */
static int clear_port_feature(struct usb_device *hdev, int port1, int feature)
{
    return usb_control_msg(hdev, usb_sndctrlpipe(hdev, 0),
                           USB_REQ_CLEAR_FEATURE, USB_RT_PORT, feature, port1,
                           NULL, 0, 1000);
}

/*
 * USB 2.0 spec Section 11.24.2.13
 */
static int set_port_feature(struct usb_device *hdev, int port1, int feature)
{
    return usb_control_msg(hdev, usb_sndctrlpipe(hdev, 0),
                           USB_REQ_SET_FEATURE, USB_RT_PORT, feature, port1,
                           NULL, 0, 1000);
}

/*
 * USB 2.0 spec Section 11.24.2.7.1.10 and table 11-7
 * for info about using port indicators
 */
static void set_port_led(
    struct usb_hub *hub,
    int port1,
    int selector
)
{
    int status = set_port_feature(hub->hdev, (selector << 8) | port1,
                                  USB_PORT_FEAT_INDICATOR);
    if (status < 0)
        USB_debug("port %d indicator %d status %d\n", port1, selector, status);
}


#define LED_CYCLE_PERIOD    ((2*HZ)/3)

//static void led_work (struct work_struct *work)
static void led_work (struct usb_hub *hub)
{
    //struct usb_hub        *hub =
    //  container_of(work, struct usb_hub, leds.work);
    struct usb_device   *hdev = hub->hdev;
    unsigned        i;
    unsigned        changed = 0;
    int         cursor = -1;

    if (hdev->state != USB_STATE_CONFIGURED || hub->quiescing)
        return;

    for (i = 0; i < hub->descriptor->bNbrPorts; i++) {
        unsigned    selector, mode;

        /* 30%-50% duty cycle */

        switch (hub->indicator[i]) {
        /* cycle marker */
        case INDICATOR_CYCLE:
            cursor = i;
            selector = HUB_LED_AUTO;
            mode = INDICATOR_AUTO;
            break;
        /* blinking green = sw attention */
        case INDICATOR_GREEN_BLINK:
            selector = HUB_LED_GREEN;
            mode = INDICATOR_GREEN_BLINK_OFF;
            break;
        case INDICATOR_GREEN_BLINK_OFF:
            selector = HUB_LED_OFF;
            mode = INDICATOR_GREEN_BLINK;
            break;
        /* blinking amber = hw attention */
        case INDICATOR_AMBER_BLINK:
            selector = HUB_LED_AMBER;
            mode = INDICATOR_AMBER_BLINK_OFF;
            break;
        case INDICATOR_AMBER_BLINK_OFF:
            selector = HUB_LED_OFF;
            mode = INDICATOR_AMBER_BLINK;
            break;
        /* blink green/amber = reserved */
        case INDICATOR_ALT_BLINK:
            selector = HUB_LED_GREEN;
            mode = INDICATOR_ALT_BLINK_OFF;
            break;
        case INDICATOR_ALT_BLINK_OFF:
            selector = HUB_LED_AMBER;
            mode = INDICATOR_ALT_BLINK;
            break;
        default:
            continue;
        }
        if (selector != HUB_LED_AUTO)
            changed = 1;
        set_port_led(hub, i + 1, selector);
        hub->indicator[i] = mode;
    }
    if (!changed && blinkenlights) {
        cursor++;
        cursor %= hub->descriptor->bNbrPorts;
        set_port_led(hub, cursor + 1, HUB_LED_GREEN);
        hub->indicator[cursor] = INDICATOR_CYCLE;
        changed++;
    }
    if (changed) {
        // schedule_delayed_work(&hub->leds, LED_CYCLE_PERIOD);
        msleep(LED_CYCLE_PERIOD);
        led_work(hub);
    }
}

/* use a short timeout for hub/port status fetches */
#define USB_STS_TIMEOUT     1000
#define USB_STS_RETRIES     5

/*
 * USB 2.0 spec Section 11.24.2.6
 */
static int get_hub_status(struct usb_device *hdev,
                          struct usb_hub_status *data)
{
    int i, status = -ETIMEDOUT;

    for (i = 0; i < USB_STS_RETRIES &&
            (status == -ETIMEDOUT || status == -EPIPE); i++) {
        status = usb_control_msg(hdev, usb_rcvctrlpipe(hdev, 0),
                                 USB_REQ_GET_STATUS, USB_DIR_IN | USB_RT_HUB, 0, 0,
                                 data, sizeof(*data), USB_STS_TIMEOUT);
    }
    return status;
}

/*
 * USB 2.0 spec Section 11.24.2.7
 */
static int get_port_status(struct usb_device *hdev, int port1,
                           struct usb_port_status *data)
{
    int i, status = -ETIMEDOUT;

    for (i = 0; i < USB_STS_RETRIES &&
            (status == -ETIMEDOUT || status == -EPIPE); i++) {
        status = usb_control_msg(hdev, usb_rcvctrlpipe(hdev, 0),
                                 USB_REQ_GET_STATUS, USB_DIR_IN | USB_RT_PORT, 0, port1,
                                 data, sizeof(*data), USB_STS_TIMEOUT);
    }
    return status;
}

static int hub_port_status(struct usb_hub *hub, int port1,
                           u16 *status, u16 *change)
{
    int ret;

    mutex_lock(&hub->status_mutex);
    ret = get_port_status(hub->hdev, port1, &hub->status->port);
    if (ret < 4) {
        USB_error("%s failed (err = %d)\n", __func__, ret);
        if (ret >= 0)
            ret = -EIO;
    } else {
        *status = le16_to_cpu(hub->status->port.wPortStatus);
        *change = le16_to_cpu(hub->status->port.wPortChange);

        ret = 0;
    }
    mutex_unlock(&hub->status_mutex);
    return ret;
}

static void kick_khubd(struct usb_hub *hub)
{
    //unsigned long flags;

    spin_lock_irqsave(&hub_event_lock, flags);
    if (!hub->disconnected && list_empty(&hub->event_list)) {
        list_add_tail(&hub->event_list, &hub_event_list);

        /* Suppress autosuspend until khubd runs */
        //usb_autopm_get_interface_no_resume(
        //      to_usb_interface(hub->intfdev));
        //wake_up(&khubd_wait);
    }
    spin_unlock_irqrestore(&hub_event_lock, flags);
}

void usb_kick_khubd(struct usb_device *hdev)
{
    struct usb_hub *hub = hdev_to_hub(hdev);

    if (hub)
        kick_khubd(hub);
}


/* completion function, fires on port status changes and various faults */
static void hub_irq(struct urb *urb)
{
    struct usb_hub *hub = urb->context;
    int status = urb->status;
    unsigned i;
    unsigned long bits;

    switch (status) {
    case -ENOENT:       /* synchronous unlink */
    case -ECONNRESET:   /* async unlink */
    case -ESHUTDOWN:    /* hardware going away */
        return;

    default:        /* presumably an error */
        /* Cause a hub reset after 10 consecutive errors */
        USB_debug("transfer --> %d\n", status);
        if ((++hub->nerrors < 10) || hub->error)
            goto resubmit;
        hub->error = status;
    /* FALL THROUGH */

    /* let khubd handle things */
    case 0:         /* we got data:  port status changed */
        bits = 0;
        for (i = 0; i < urb->actual_length; ++i)
            bits |= ((unsigned long) ((*hub->buffer)[i])) << (i*8);
        hub->event_bits[0] = bits;
        break;
    }

    hub->nerrors = 0;

