OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
    /* Something happened, let khubd figure it out */
    kick_khubd(hub);

resubmit:
    if (hub->quiescing)
        return;

    if ((status = usb_submit_urb (hub->urb, GFP_ATOMIC)) != 0
            && status != -ENODEV && status != -EPERM)
        USB_error("resubmit error --> %d\n", status);
}


#if 0
/* USB 2.0 spec Section 11.24.2.3 */
static inline int
hub_clear_tt_buffer (struct usb_device *hdev, u16 devinfo, u16 tt)
{
    return usb_control_msg(hdev, usb_sndctrlpipe(hdev, 0),
                           HUB_CLEAR_TT_BUFFER, USB_RT_PORT, devinfo,
                           tt, NULL, 0, 1000);
}

/*
 * enumeration blocks khubd for a long time. we use keventd instead, since
 * long blocking there is the exception, not the rule.  accordingly, HCDs
 * talking to TTs must queue control transfers (not just bulk and iso), so
 * both can talk to the same hub concurrently.
 */
static void hub_tt_work(struct work_struct *work)
{
    struct usb_hub      *hub =
        container_of(work, struct usb_hub, tt.clear_work);
    unsigned long       flags;
    int         limit = 100;

    spin_lock_irqsave (&hub->tt.lock, flags);
    while (--limit && !list_empty (&hub->tt.clear_list)) {
        struct list_head    *next;
        struct usb_tt_clear *clear;
        struct usb_device   *hdev = hub->hdev;
        const struct hc_driver  *drv;
        int         status;

        next = hub->tt.clear_list.next;
        clear = list_entry (next, struct usb_tt_clear, clear_list);
        list_del (&clear->clear_list);

        /* drop lock so HCD can concurrently report other TT errors */
        spin_unlock_irqrestore (&hub->tt.lock, flags);
        status = hub_clear_tt_buffer (hdev, clear->devinfo, clear->tt);
        if (status)
            USB_error("clear tt %d (%04x) error %d\n", clear->tt, clear->devinfo, status);

        /* Tell the HCD, even if the operation failed */
        drv = clear->hcd->driver;
        if (drv->clear_tt_buffer_complete)
            (drv->clear_tt_buffer_complete)(clear->hcd, clear->ep);

        kfree(clear);
        spin_lock_irqsave(&hub->tt.lock, flags);
    }
    spin_unlock_irqrestore (&hub->tt.lock, flags);
}
#endif

/**
 * usb_hub_clear_tt_buffer - clear control/bulk TT state in high speed hub
 * @urb: an URB associated with the failed or incomplete split transaction
 *
 * High speed HCDs use this to tell the hub driver that some split control or
 * bulk transaction failed in a way that requires clearing internal state of
 * a transaction translator.  This is normally detected (and reported) from
 * interrupt context.
 *
 * It may not be possible for that hub to handle additional full (or low)
 * speed transactions until that state is fully cleared out.
 */
#if 0   // Nuvoton ??? - hub TT 
int usb_hub_clear_tt_buffer(struct urb *urb)
{
    struct usb_device   *udev = urb->dev;
    int         pipe = urb->pipe;
    struct usb_tt       *tt = udev->tt;
    unsigned long       flags;
    struct usb_tt_clear *clear;

    /* we've got to cope with an arbitrary number of pending TT clears,
     * since each TT has "at least two" buffers that can need it (and
     * there can be many TTs per hub).  even if they're uncommon.
     */
    if ((clear = kmalloc (sizeof *clear, GFP_ATOMIC)) == NULL) {
        USB_error("can't save CLEAR_TT_BUFFER state\n");
        /* FIXME recover somehow ... RESET_TT? */
        return -ENOMEM;
    }

    /* info that CLEAR_TT_BUFFER needs */
    clear->tt = tt->multi ? udev->ttport : 1;
    clear->devinfo = usb_pipeendpoint (pipe);
    clear->devinfo |= udev->devnum << 4;
    clear->devinfo |= usb_pipecontrol (pipe)
                      ? (USB_ENDPOINT_XFER_CONTROL << 11)
                      : (USB_ENDPOINT_XFER_BULK << 11);
    if (usb_pipein (pipe))
        clear->devinfo |= 1 << 15;

    /* info for completion callback */
    clear->hcd = bus_to_hcd(udev->bus);
    clear->ep = urb->ep;

    /* tell keventd to clear state for this TT */
    spin_lock_irqsave (&tt->lock, flags);
    list_add_tail (&clear->clear_list, &tt->clear_list);
    schedule_work(&tt->clear_work);
    spin_unlock_irqrestore (&tt->lock, flags);
    return 0;
}
#endif

/* If do_delay is false, return the number of milliseconds the caller
 * needs to delay.
 */
static unsigned hub_power_on(struct usb_hub *hub, bool do_delay)
{
    int port1;
    unsigned pgood_delay = hub->descriptor->bPwrOn2PwrGood * 2;
    unsigned delay;
    u16 wHubCharacteristics =
        le16_to_cpu(hub->descriptor->wHubCharacteristics);

    /* Enable power on each port.  Some hubs have reserved values
     * of LPSM (> 2) in their descriptors, even though they are
     * USB 2.0 hubs.  Some hubs do not implement port-power switching
     * but only emulate it.  In all cases, the ports won't work
     * unless we send these messages to the hub.
     */
    if ((wHubCharacteristics & HUB_CHAR_LPSM) < 2)
        USB_vdebug("enabling power on all ports\n");
    else
        USB_vdebug("trying to enable port power on non-switchable hub\n");
    for (port1 = 1; port1 <= hub->descriptor->bNbrPorts; port1++)
        set_port_feature(hub->hdev, port1, USB_PORT_FEAT_POWER);

    /* Wait at least 100 msec for power to become stable */
    delay = max(pgood_delay, (unsigned) 100);
    if (do_delay)
        msleep(delay);
    return delay;
}

static int hub_hub_status(struct usb_hub *hub,
                          u16 *status, u16 *change)
{
    int ret;

    mutex_lock(&hub->status_mutex);
    ret = get_hub_status(hub->hdev, &hub->status->hub);
    if (ret < 0)
        USB_error("%s failed (err = %d)\n", __func__, ret);
    else {
        *status = le16_to_cpu(hub->status->hub.wHubStatus);
        *change = le16_to_cpu(hub->status->hub.wHubChange);
        ret = 0;
    }
    mutex_unlock(&hub->status_mutex);
    return ret;
}

static int hub_port_disable(struct usb_hub *hub, int port1, int set_state)
{
    struct usb_device *hdev = hub->hdev;
    int ret = 0;

    if (hdev->children[port1-1] && set_state)
        usb_set_device_state(hdev->children[port1-1],
                             USB_STATE_NOTATTACHED);
    if (!hub->error && !hub_is_superspeed(hub->hdev))
        ret = clear_port_feature(hdev, port1, USB_PORT_FEAT_ENABLE);
    if (ret)
        USB_error("cannot disable port %d (err = %d)\n", port1, ret);
    return ret;
}

