OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
/*
 * Disable a port and mark a logical connect-change event, so that some
 * time later khubd will disconnect() any existing usb_device on the port
 * and will re-enumerate if there actually is a device attached.
 */
static void hub_port_logical_disconnect(struct usb_hub *hub, int port1)
{
    USB_vdebug("logical disconnect on port %d\n", port1);
    hub_port_disable(hub, port1, 1);

    /* FIXME let caller ask to power down the port:
     *  - some devices won't enumerate without a VBUS power cycle
     *  - SRP saves power that way
     *  - ... new call, TBD ...
     * That's easy if this hub can switch power per-port, and
     * khubd reactivates the port later (timer, SRP, etc).
     * Powerdown must be optional, because of reset/DFU.
     */

    set_bit(port1, hub->change_bits);
    kick_khubd(hub);
}

/**
 * usb_remove_device - disable a device's port on its parent hub
 * @udev: device to be disabled and removed
 * Context: @udev locked, must be able to sleep.
 *
 * After @udev's port has been disabled, khubd is notified and it will
 * see that the device has been disconnected.  When the device is
 * physically unplugged and something is plugged in, the events will
 * be received and processed normally.
 */
int usb_remove_device(struct usb_device *udev)
{
    struct usb_hub *hub;
    struct usb_interface *intf;

    if (!udev->parent)  /* Can't remove a root hub */
        return -EINVAL;
    hub = hdev_to_hub(udev->parent);
    intf = to_usb_interface_by_dev(hub->intfdev);   //to_usb_interface(hub->intfdev);

    usb_autopm_get_interface(intf);
    set_bit(udev->portnum, hub->removed_bits);
    hub_port_logical_disconnect(hub, udev->portnum);
    usb_autopm_put_interface(intf);
    return 0;
}

enum hub_activation_type {
    HUB_INIT, HUB_INIT2, HUB_INIT3,     /* INITs must come first */
    HUB_POST_RESET, HUB_RESUME, HUB_RESET_RESUME
};


static void hub_init_func2(struct usb_hub *hub);  //static void hub_init_func2(struct work_struct *ws);
static void hub_init_func3(struct usb_hub *hub);  //static void hub_init_func3(struct work_struct *ws);


static void hub_activate(struct usb_hub *hub, enum hub_activation_type type)
{
    struct usb_device *hdev = hub->hdev;
    struct usb_hcd *hcd;
    int ret;
    int port1;
    int status;
    bool need_debounce_delay = false;
    unsigned delay;

    /* Continue a partial initialization */
    if (type == HUB_INIT2)
        goto init2;
    if (type == HUB_INIT3)
        goto init3;

    /* The superspeed hub except for root hub has to use Hub Depth
     * value as an offset into the route string to locate the bits
     * it uses to determine the downstream port number. So hub driver
     * should send a set hub depth request to superspeed hub after
     * the superspeed hub is set configuration in initialization or
     * reset procedure.
     *
     * After a resume, port power should still be on.
     * For any other type of activation, turn it on.
     */
    if (type != HUB_RESUME) {
        if (hdev->parent && hub_is_superspeed(hdev)) {
            ret = usb_control_msg(hdev, usb_sndctrlpipe(hdev, 0),
                                  HUB_SET_DEPTH, USB_RT_HUB,
                                  hdev->level - 1, 0, NULL, 0,
                                  USB_CTRL_SET_TIMEOUT);
            if (ret < 0)
                USB_error("set hub depth failed\n");
        }

        /* Speed up system boot by using a delayed_work for the
         * hub's initial power-up delays.  This is pretty awkward
         * and the implementation looks like a home-brewed sort of
         * setjmp/longjmp, but it saves at least 100 ms for each
         * root hub (assuming usbcore is compiled into the kernel
         * rather than as a module).  It adds up.
         *
         * This can't be done for HUB_RESUME or HUB_RESET_RESUME
         * because for those activation types the ports have to be
         * operational when we return.  In theory this could be done
         * for HUB_POST_RESET, but it's easier not to.
         */
        if (type == HUB_INIT) {
            delay = hub_power_on(hub, false);
#ifdef NUVOTON_PORTED
            msleep(delay);
            hub_init_func2(hub);
#else
            PREPARE_DELAYED_WORK(&hub->init_work, hub_init_func2);
            schedule_delayed_work(&hub->init_work, msecs_to_jiffies(delay));
#endif

            /* Suppress autosuspend until init is done */
            usb_autopm_get_interface_no_resume(
                to_usb_interface_by_dev(hub->intfdev)); // to_usb_interface(hub->intfdev));
            return;     /* Continues at init2: below */
        } else if (type == HUB_RESET_RESUME) {
            /* The internal host controller state for the hub device
             * may be gone after a host power loss on system resume.
             * Update the device's info so the HW knows it's a hub.
             */
            hcd = bus_to_hcd(hdev->bus);
            if (hcd->driver->update_hub_device) {
                ret = hcd->driver->update_hub_device(hcd, hdev,
                                                     &hub->tt, GFP_NOIO);
                if (ret < 0) {
                    USB_error("Host not accepting hub info update.\n");
                    USB_error("LS/FS devices and hubs may not work under this hub\n.");
                }
            }
            hub_power_on(hub, true);
        } else {
            hub_power_on(hub, true);
        }
    }
init2:

    /* Check each port and set hub->change_bits to let khubd know
     * which ports need attention.
     */
    for (port1 = 1; port1 <= hdev->maxchild; ++port1) {
        struct usb_device *udev = hdev->children[port1-1];
        u16 portstatus, portchange;

        portstatus = portchange = 0;
        status = hub_port_status(hub, port1, &portstatus, &portchange);
        if (udev || (portstatus & USB_PORT_STAT_CONNECTION))
            USB_debug("port %d: status %04x change %04x\n",
                      port1, portstatus, portchange);

        /* After anything other than HUB_RESUME (i.e., initialization
         * or any sort of reset), every port should be disabled.
         * Unconnected ports should likewise be disabled (paranoia),
         * and so should ports for which we have no usb_device.
         */
        if ((portstatus & USB_PORT_STAT_ENABLE) && (
                    type != HUB_RESUME ||
                    !(portstatus & USB_PORT_STAT_CONNECTION) ||
                    !udev ||
                    udev->state == USB_STATE_NOTATTACHED)) {
            /*
             * USB3 protocol ports will automatically transition
             * to Enabled state when detect an USB3.0 device attach.
             * Do not disable USB3 protocol ports.
             */
            if (!hub_is_superspeed(hdev)) {
                clear_port_feature(hdev, port1,
                                   USB_PORT_FEAT_ENABLE);
                portstatus &= ~USB_PORT_STAT_ENABLE;
            } else {
                /* Pretend that power was lost for USB3 devs */
                portstatus &= ~USB_PORT_STAT_ENABLE;
            }
        }

        /* Clear status-change flags; we'll debounce later */
        if (portchange & USB_PORT_STAT_C_CONNECTION) {
            need_debounce_delay = true;
            clear_port_feature(hub->hdev, port1,
                               USB_PORT_FEAT_C_CONNECTION);
        }
        if (portchange & USB_PORT_STAT_C_ENABLE) {
            need_debounce_delay = true;
            clear_port_feature(hub->hdev, port1,
                               USB_PORT_FEAT_C_ENABLE);
        }
        if (portchange & USB_PORT_STAT_C_LINK_STATE) {
            need_debounce_delay = true;
            clear_port_feature(hub->hdev, port1,
                               USB_PORT_FEAT_C_PORT_LINK_STATE);
        }

        if ((portchange & USB_PORT_STAT_C_BH_RESET) &&
                hub_is_superspeed(hub->hdev)) {
            need_debounce_delay = true;
            clear_port_feature(hub->hdev, port1,
                               USB_PORT_FEAT_C_BH_PORT_RESET);
        }
        /* We can forget about a "removed" device when there's a
         * physical disconnect or the connect status changes.
         */
        if (!(portstatus & USB_PORT_STAT_CONNECTION) ||
                (portchange & USB_PORT_STAT_C_CONNECTION))
            clear_bit(port1, hub->removed_bits);

        if (!udev || udev->state == USB_STATE_NOTATTACHED) {
            /* Tell khubd to disconnect the device or
             * check for a new connection
             */
            if (udev || (portstatus & USB_PORT_STAT_CONNECTION))
                set_bit(port1, hub->change_bits);

        } else if (portstatus & USB_PORT_STAT_ENABLE) {
            /* The power session apparently survived the resume.
             * If there was an overcurrent or suspend change
             * (i.e., remote wakeup request), have khubd
             * take care of it.
             */
            if (portchange)
                set_bit(port1, hub->change_bits);

        } else if (udev->persist_enabled) {
#ifdef CONFIG_PM
            udev->reset_resume = 1;
#endif
            set_bit(port1, hub->change_bits);

        } else {
            /* The power session is gone; tell khubd */
            usb_set_device_state(udev, USB_STATE_NOTATTACHED);
            set_bit(port1, hub->change_bits);
        }
    }

