OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
    /* If no port-status-change flags were set, we don't need any
     * debouncing.  If flags were set we can try to debounce the
     * ports all at once right now, instead of letting khubd do them
     * one at a time later on.
     *
     * If any port-status changes do occur during this delay, khubd
     * will see them later and handle them normally.
     */
    if (need_debounce_delay) {
        delay = HUB_DEBOUNCE_STABLE;

        /* Don't do a long sleep inside a workqueue routine */
        if (type == HUB_INIT2) {
#ifdef NUVOTON_PORTED
            msleep(delay);
            hub_init_func3(hub);
#else
            PREPARE_DELAYED_WORK(&hub->init_work, hub_init_func3);
            schedule_delayed_work(&hub->init_work,
                                  msecs_to_jiffies(delay));
#endif
            return;     /* Continues at init3: below */
        } else {
            msleep(delay);
        }
    }
init3:
    hub->quiescing = 0;

    status = usb_submit_urb(hub->urb, GFP_NOIO);
    if (status < 0)
        USB_error("activate --> %d\n", status);
    if (hub->has_indicators && blinkenlights) {
        // schedule_delayed_work(&hub->leds, LED_CYCLE_PERIOD);
        msleep(LED_CYCLE_PERIOD);
        led_work(hub);
    }

    /* Scan all ports that need attention */
    kick_khubd(hub);

    /* Allow autosuspend if it was suppressed */
    if (type <= HUB_INIT3)
        // usb_autopm_put_interface_async(to_usb_interface(hub->intfdev));
        usb_autopm_put_interface_async(to_usb_interface_by_dev(hub->intfdev));
}

/* Implement the continuations for the delays above */
//static void hub_init_func2(struct work_struct *ws)
static void hub_init_func2(struct usb_hub *hub)
{
    //struct usb_hub *hub = container_of(ws, struct usb_hub, init_work.work);

    hub_activate(hub, HUB_INIT2);
}

//static void hub_init_func3(struct work_struct *ws)
static void hub_init_func3(struct usb_hub *hub)
{
    //struct usb_hub *hub = container_of(ws, struct usb_hub, init_work.work);

    hub_activate(hub, HUB_INIT3);
}

enum hub_quiescing_type {
    HUB_DISCONNECT, HUB_PRE_RESET, HUB_SUSPEND
};

static void hub_quiesce(struct usb_hub *hub, enum hub_quiescing_type type)
{
    struct usb_device *hdev = hub->hdev;
    int i;

    //cancel_delayed_work_sync(&hub->init_work);

    /* khubd and related activity won't re-trigger */
    hub->quiescing = 1;

    if (type != HUB_SUSPEND) {
        /* Disconnect all the children */
        for (i = 0; i < hdev->maxchild; ++i) {
            if (hdev->children[i])
                usb_disconnect(&hdev->children[i]);
        }
    }

    /* Stop khubd and related activity */
    usb_kill_urb(hub->urb);
    //if (hub->has_indicators)
    //  cancel_delayed_work_sync(&hub->leds);
    //if (hub->tt.hub)
    //  cancel_work_sync(&hub->tt.clear_work);
}

/* caller has locked the hub device */
static int hub_pre_reset(struct usb_interface *intf)
{
    struct usb_hub *hub = usb_get_intfdata(intf);

    hub_quiesce(hub, HUB_PRE_RESET);
    return 0;
}

/* caller has locked the hub device */
static int hub_post_reset(struct usb_interface *intf)
{
    struct usb_hub *hub = usb_get_intfdata(intf);

    hub_activate(hub, HUB_POST_RESET);
    return 0;
}

static int hub_configure(struct usb_hub *hub,
                         struct usb_endpoint_descriptor *endpoint)
{
    struct usb_hcd *hcd;
    struct usb_device *hdev = hub->hdev;
    //struct device *hub_dev = hub->intfdev;
    u16 hubstatus, hubchange;
    u16 wHubCharacteristics;
    unsigned int pipe;
    int maxp, ret;
    char *message = "out of memory";

    hub->buffer = kmalloc(sizeof(*hub->buffer), GFP_KERNEL);
    if (!hub->buffer) {
        ret = -ENOMEM;
        goto fail;
    }

    hub->status = kmalloc(sizeof(*hub->status), GFP_KERNEL);
    if (!hub->status) {
        ret = -ENOMEM;
        goto fail;
    }
    //mutex_init(&hub->status_mutex);

    hub->descriptor = kmalloc(sizeof(*hub->descriptor), GFP_KERNEL);
    if (!hub->descriptor) {
        ret = -ENOMEM;
        goto fail;
    }

    /* Request the entire hub descriptor.
     * hub->descriptor can handle USB_MAXCHILDREN ports,
     * but the hub can/will return fewer bytes here.
     */
    ret = get_hub_descriptor(hdev, hub->descriptor);
    if (ret < 0) {
        message = "can't read hub descriptor";
        goto fail;
    } else if (hub->descriptor->bNbrPorts > USB_MAXCHILDREN) {
        message = "hub has too many ports!";
        ret = -ENODEV;
        goto fail;
    }

    hdev->maxchild = hub->descriptor->bNbrPorts;
    USB_debug("%d port%s detected\n", hdev->maxchild, (hdev->maxchild == 1) ? "" : "s");

    hub->port_owners = kzalloc(hdev->maxchild * sizeof(void *), GFP_KERNEL);
    if (!hub->port_owners) {
        ret = -ENOMEM;
        goto fail;
    }

    wHubCharacteristics = le16_to_cpu(hub->descriptor->wHubCharacteristics);

    /* FIXME for USB 3.0, skip for now */
    if ((wHubCharacteristics & HUB_CHAR_COMPOUND) &&
            !(hub_is_superspeed(hdev))) {
#ifdef DEBUG
        int i;
        char    portstr [USB_MAXCHILDREN + 1];

        for (i = 0; i < hdev->maxchild; i++)
            portstr[i] = hub->descriptor->u.hs.DeviceRemovable
                         [((i + 1) / 8)] & (1 << ((i + 1) % 8))
                         ? 'F' : 'R';
        portstr[hdev->maxchild] = 0;
#endif
        USB_debug("compound device; port removable status: %s\n", portstr);
    } else
        USB_debug("standalone hub\n");

    switch (wHubCharacteristics & HUB_CHAR_LPSM) {
    case 0x00:
        USB_vdebug("ganged power switching\n");
        break;
    case 0x01:
        USB_vdebug("individual port power switching\n");
        break;
    case 0x02:
    case 0x03:
        USB_vdebug("no power switching (usb 1.0)\n");
        break;
    }

    switch (wHubCharacteristics & HUB_CHAR_OCPM) {
    case 0x00:
        USB_vdebug("global over-current protection\n");
        break;
    case 0x08:
        USB_vdebug("individual port over-current protection\n");
        break;
    case 0x10:
    case 0x18:
        USB_vdebug("no over-current protection\n");
        break;
    }

