OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
    //spin_lock_init (&hub->tt.lock);
    INIT_LIST_HEAD (&hub->tt.clear_list);
    //INIT_WORK(&hub->tt.clear_work, hub_tt_work);
    switch (hdev->descriptor.bDeviceProtocol) {
    case 0:
        break;
    case 1:
        USB_debug("Single TT\n");
        hub->tt.hub = hdev;
        break;
    case 2:
        ret = usb_set_interface(hdev, 0, 1);
        if (ret == 0) {
            USB_debug("TT per port\n");
            hub->tt.multi = 1;
        } else
            USB_error("Using single TT (err %d)\n", ret);
        hub->tt.hub = hdev;
        break;
    case 3:
        /* USB 3.0 hubs don't have a TT */
        break;
    default:
        USB_debug("Unrecognized hub protocol %d\n", hdev->descriptor.bDeviceProtocol);
        break;
    }

    /* Note 8 FS bit times == (8 bits / 12000000 bps) ~= 666ns */
    switch (wHubCharacteristics & HUB_CHAR_TTTT) {
    case HUB_TTTT_8_BITS:
        if (hdev->descriptor.bDeviceProtocol != 0) {
            hub->tt.think_time = 666;
            USB_debug("TT requires at most %d FS bit times (%d ns)\n",
                      8, hub->tt.think_time);
        }
        break;
    case HUB_TTTT_16_BITS:
        hub->tt.think_time = 666 * 2;
        USB_debug("TT requires at most %d FS bit times (%d ns)\n",
                  16, hub->tt.think_time);
        break;
    case HUB_TTTT_24_BITS:
        hub->tt.think_time = 666 * 3;
        USB_debug("TT requires at most %d FS bit times (%d ns)\n",
                  24, hub->tt.think_time);
        break;
    case HUB_TTTT_32_BITS:
        hub->tt.think_time = 666 * 4;
        USB_debug("TT requires at most %d FS bit times (%d ns)\n",
                  32, hub->tt.think_time);
        break;
    }

    /* probe() zeroes hub->indicator[] */
    if (wHubCharacteristics & HUB_CHAR_PORTIND) {
        hub->has_indicators = 1;
        USB_vdebug("Port indicators are supported\n");
    }

    USB_vdebug("power on to power good time: %dms\n", hub->descriptor->bPwrOn2PwrGood * 2);

    /* power budgeting mostly matters with bus-powered hubs,
     * and battery-powered root hubs (may provide just 8 mA).
     */
    ret = usb_get_status(hdev, USB_RECIP_DEVICE, 0, &hubstatus);
    if (ret < 2) {
        message = "can't get hub status";
        goto fail;
    }
    le16_to_cpus(&hubstatus);
    if (hdev == hdev->bus->root_hub) {
        if (hdev->bus_mA == 0 || hdev->bus_mA >= 500)
            hub->mA_per_port = 500;
        else {
            hub->mA_per_port = hdev->bus_mA;
            hub->limited_power = 1;
        }
    } else if ((hubstatus & (1 << USB_DEVICE_SELF_POWERED)) == 0) {
        USB_vdebug("hub controller current requirement: %dmA\n",
                   hub->descriptor->bHubContrCurrent);
        hub->limited_power = 1;
        if (hdev->maxchild > 0) {
            int remaining = hdev->bus_mA -
                            hub->descriptor->bHubContrCurrent;

            if (remaining < hdev->maxchild * 100)
                USB_error("insufficient power available to use all downstream ports\n");
            hub->mA_per_port = 100;     /* 7.2.1.1 */
        }
    } else {    /* Self-powered external hub */
        /* FIXME: What about battery-powered external hubs that
         * provide less current per port? */
        hub->mA_per_port = 500;
    }
    if (hub->mA_per_port < 500)
        USB_vdebug("%umA bus power budget for each child\n", hub->mA_per_port);

    /* Update the HCD's internal representation of this hub before khubd
     * starts getting port status changes for devices under the hub.
     */
    hcd = bus_to_hcd(hdev->bus);
    if (hcd->driver->update_hub_device) {
        ret = hcd->driver->update_hub_device(hcd, hdev,
                                             &hub->tt, GFP_KERNEL);
        if (ret < 0) {
            message = "can't update HCD hub info";
            goto fail;
        }
    }

    ret = hub_hub_status(hub, &hubstatus, &hubchange);
    if (ret < 0) {
        message = "can't get hub status";
        goto fail;
    }

    /* local power status reports aren't always correct */
    if (hdev->actconfig->desc.bmAttributes & USB_CONFIG_ATT_SELFPOWER)
        USB_vdebug("local power source is %s\n",
                   (hubstatus & HUB_STATUS_LOCAL_POWER)
                   ? "lost (inactive)" : "good");

    if ((wHubCharacteristics & HUB_CHAR_OCPM) == 0)
        USB_vdebug("%sover-current condition exists\n",
                   (hubstatus & HUB_STATUS_OVERCURRENT) ? "" : "no ");

    /* set up the interrupt endpoint
     * We use the EP's maxpacket size instead of (PORTS+1+7)/8
     * bytes as USB2.0[11.12.3] says because some hubs are known
     * to send more data (and thus cause overflow). For root hubs,
     * maxpktsize is defined in hcd.c's fake endpoint descriptors
     * to be big enough for at least USB_MAXCHILDREN ports. */
    pipe = usb_rcvintpipe(hdev, endpoint->bEndpointAddress);
    maxp = usb_maxpacket(hdev, pipe, usb_pipeout(pipe));

    if (maxp > sizeof(*hub->buffer))
        maxp = sizeof(*hub->buffer);

    hub->urb = usb_alloc_urb(0, GFP_KERNEL);
    if (!hub->urb) {
        ret = -ENOMEM;
        goto fail;
    }

    usb_fill_int_urb(hub->urb, hdev, pipe, *hub->buffer, maxp, hub_irq,
                     hub, endpoint->bInterval);

    /* maybe cycle the hub leds */
    if (hub->has_indicators && blinkenlights)
        hub->indicator [0] = INDICATOR_CYCLE;

    hub_activate(hub, HUB_INIT);
    return 0;

fail:
    USB_error("config failed, %s (err %d)\n", message, ret);
    /* hub_disconnect() frees urb and descriptor */
    return ret;
}

//static void hub_release(struct kref *kref)
static void hub_release(struct usb_hub *hub)
{
    //struct usb_hub *hub = container_of(kref, struct usb_hub, kref);

    //usb_put_intf(to_usb_interface(hub->intfdev));
    usb_put_intf(to_usb_interface_by_dev(hub->intfdev));
    kfree(hub);
}

static unsigned highspeed_hubs;

static void hub_disconnect(struct usb_interface *intf)
{
    struct usb_hub *hub = usb_get_intfdata (intf);

    /* Take the hub off the event list and don't let it be added again */
    spin_lock_irq(&hub_event_lock);
    if (!list_empty(&hub->event_list)) {
        list_del_init(&hub->event_list);
        usb_autopm_put_interface_no_suspend(intf);
    }
    hub->disconnected = 1;
    spin_unlock_irq(&hub_event_lock);

    /* Disconnect all children and quiesce the hub */
    hub->error = 0;
    hub_quiesce(hub, HUB_DISCONNECT);

