OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
    usb_set_intfdata (intf, NULL);
    hub->hdev->maxchild = 0;

    if (hub->hdev->speed == USB_SPEED_HIGH)
        highspeed_hubs--;

    usb_free_urb(hub->urb);
    kfree(hub->port_owners);
    kfree(hub->descriptor);
    kfree(hub->status);
    kfree(hub->buffer);

    //kref_put(&hub->kref, hub_release);
    hub->kref--;
    if (hub->kref == 0)
        hub_release(hub);
}

static int hub_probe(struct usb_interface *intf, const struct usb_device_id *id)
{
    struct usb_host_interface *desc;
    struct usb_endpoint_descriptor *endpoint;
    struct usb_device *hdev;
    struct usb_hub *hub;

    desc = intf->cur_altsetting;
    hdev = interface_to_usbdev(intf);

    /* Hubs have proper suspend/resume support.  USB 3.0 device suspend is
     * different from USB 2.0/1.1 device suspend, and unfortunately we
     * don't support it yet.  So leave autosuspend disabled for USB 3.0
     * external hubs for now.  Enable autosuspend for USB 3.0 roothubs,
     * since that isn't a "real" hub.
     */
    if (!hub_is_superspeed(hdev) || !hdev->parent)
        usb_enable_autosuspend(hdev);

    if (hdev->level == MAX_TOPO_LEVEL) {
        USB_error("Unsupported bus topology: hub nested too deep\n");
        return -E2BIG;
    }

#ifdef  CONFIG_USB_OTG_BLACKLIST_HUB
    if (hdev->parent) {
        USB_error("ignoring external hub\n");
        return -ENODEV;
    }
#endif

    /* Some hubs have a subclass of 1, which AFAICT according to the */
    /*  specs is not defined, but it works */
    if ((desc->desc.bInterfaceSubClass != 0) &&
            (desc->desc.bInterfaceSubClass != 1)) {
descriptor_error:
        USB_vdebug("hub_probe - bad descriptor, ignoring hub\n");
        return -EIO;
    }

    /* Multiple endpoints? What kind of mutant ninja-hub is this? */
    if (desc->desc.bNumEndpoints != 1)
        goto descriptor_error;
    endpoint = &desc->endpoint[0].desc;

    /* If it's not an interrupt in endpoint, we'd better punt! */
    if (!usb_endpoint_is_int_in(endpoint))
        goto descriptor_error;

    /* We found a hub */
    USB_debug("USB hub found\n");

    hub = kzalloc(sizeof(*hub), GFP_KERNEL);
    if (!hub) {
        USB_debug("couldn't kmalloc hub struct\n");
        return -ENOMEM;
    }

    //kref_init(&hub->kref);
    hub->kref = 0;
    INIT_LIST_HEAD(&hub->event_list);
    hub->intfdev = &intf->dev;
    hub->hdev = hdev;
    //INIT_DELAYED_WORK(&hub->leds, led_work);
    //INIT_DELAYED_WORK(&hub->init_work, NULL);
    usb_get_intf(intf);

    usb_set_intfdata (intf, hub);
    intf->needs_remote_wakeup = 1;

    if (hdev->speed == USB_SPEED_HIGH)
        highspeed_hubs++;

    if (hub_configure(hub, endpoint) >= 0)
        return 0;

    hub_disconnect (intf);
    return -ENODEV;
}

#if 0
/* No BKL needed */
static int
hub_ioctl(struct usb_interface *intf, unsigned int code, void *user_data)
{
    struct usb_device *hdev = interface_to_usbdev (intf);

    /* assert ifno == 0 (part of hub spec) */
    switch (code) {
    case USBDEVFS_HUB_PORTINFO: {
        struct usbdevfs_hub_portinfo *info = user_data;
        int i;

        spin_lock_irq(&device_state_lock);
        if (hdev->devnum <= 0)
            info->nports = 0;
        else {
            info->nports = hdev->maxchild;
            for (i = 0; i < info->nports; i++) {
                if (hdev->children[i] == NULL)
                    info->port[i] = 0;
                else
                    info->port[i] =
                        hdev->children[i]->devnum;
            }
        }
        spin_unlock_irq(&device_state_lock);

        return info->nports + 1;
    }

    default:
        return -ENOSYS;
    }
}
#endif

/*
 * Allow user programs to claim ports on a hub.  When a device is attached
 * to one of these "claimed" ports, the program will "own" the device.
 */
static int find_port_owner(struct usb_device *hdev, unsigned port1,
                           void ***ppowner)
{
    if (hdev->state == USB_STATE_NOTATTACHED)
        return -ENODEV;
    if (port1 == 0 || port1 > hdev->maxchild)
        return -EINVAL;

    /* This assumes that devices not managed by the hub driver
     * will always have maxchild equal to 0.
     */
    *ppowner = &(hdev_to_hub(hdev)->port_owners[port1 - 1]);
    return 0;
}

/* In the following three functions, the caller must hold hdev's lock */
int usb_hub_claim_port(struct usb_device *hdev, unsigned port1, void *owner)
{
    int rc;
    void **powner;

    rc = find_port_owner(hdev, port1, &powner);
    if (rc)
        return rc;
    if (*powner)
        return -EBUSY;
    *powner = owner;
    return rc;
}

int usb_hub_release_port(struct usb_device *hdev, unsigned port1, void *owner)
{
    int rc;
    void **powner;

    rc = find_port_owner(hdev, port1, &powner);
    if (rc)
        return rc;
    if (*powner != owner)
        return -ENOENT;
    *powner = NULL;
    return rc;
}

void usb_hub_release_all_ports(struct usb_device *hdev, void *owner)
{
    int n;
    void **powner;

    n = find_port_owner(hdev, 1, &powner);
    if (n == 0) {
        for (; n < hdev->maxchild; (++n, ++powner)) {
            if (*powner == owner)
                *powner = NULL;
        }
    }
}

/* The caller must hold udev's lock */
bool usb_device_is_owned(struct usb_device *udev)
{
    struct usb_hub *hub;

    if (udev->state == USB_STATE_NOTATTACHED || !udev->parent)
        return false;
    hub = hdev_to_hub(udev->parent);
    return !!hub->port_owners[udev->portnum - 1];
}


static void recursively_mark_NOTATTACHED(struct usb_device *udev)
{
    int i;

    for (i = 0; i < udev->maxchild; ++i) {
        if (udev->children[i])
            recursively_mark_NOTATTACHED(udev->children[i]);
    }
    if (udev->state == USB_STATE_SUSPENDED)
        udev->active_duration -= jiffies;
    udev->state = USB_STATE_NOTATTACHED;
}

/**
 * usb_set_device_state - change a device's current state (usbcore, hcds)
 * @udev: pointer to device whose state should be changed
 * @new_state: new state value to be stored
 *
 * udev->state is _not_ fully protected by the device lock.  Although
 * most transitions are made only while holding the lock, the state can
 * can change to USB_STATE_NOTATTACHED at almost any time.  This
 * is so that devices can be marked as disconnected as soon as possible,
 * without having to wait for any semaphores to be released.  As a result,
 * all changes to any device's state must be protected by the
 * device_state_lock spinlock.
 *
 * Once a device has been added to the device tree, all changes to its state
 * should be made using this routine.  The state should _not_ be set directly.
 *
 * If udev->state is already USB_STATE_NOTATTACHED then no change is made.
 * Otherwise udev->state is set to new_state, and if new_state is
 * USB_STATE_NOTATTACHED then all of udev's descendants' states are also set
 * to USB_STATE_NOTATTACHED.
 */
void usb_set_device_state(struct usb_device *udev,
                          enum usb_device_state new_state)
{
    //unsigned long flags;
    //int wakeup = -1;

    spin_lock_irqsave(&device_state_lock, flags);
    if (udev->state == USB_STATE_NOTATTACHED)
        ;   /* do nothing */
    else if (new_state != USB_STATE_NOTATTACHED) {

        /* root hub wakeup capabilities are managed out-of-band
         * and may involve silicon errata ... ignore them here.
         */
#if 0
        if (udev->parent) {
            if (udev->state == USB_STATE_SUSPENDED
                    || new_state == USB_STATE_SUSPENDED)
                ;   /* No change to wakeup settings */
            else if (new_state == USB_STATE_CONFIGURED)
                wakeup = udev->actconfig->desc.bmAttributes
                         & USB_CONFIG_ATT_WAKEUP;
            else
                wakeup = 0;
        }
#endif
        if (udev->state == USB_STATE_SUSPENDED &&
                new_state != USB_STATE_SUSPENDED)
            udev->active_duration -= jiffies;
        else if (new_state == USB_STATE_SUSPENDED &&
                 udev->state != USB_STATE_SUSPENDED)
            udev->active_duration += jiffies;
        udev->state = new_state;
    } else
        recursively_mark_NOTATTACHED(udev);
    spin_unlock_irqrestore(&device_state_lock, flags);
    //if (wakeup >= 0)
    //  device_set_wakeup_capable(&udev->dev, wakeup);
}

