OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
/*
 * Choose a device number.
 *
 * Device numbers are used as filenames in usbfs.  On USB-1.1 and
 * USB-2.0 buses they are also used as device addresses, however on
 * USB-3.0 buses the address is assigned by the controller hardware
 * and it usually is not the same as the device number.
 *
 * WUSB devices are simple: they have no hubs behind, so the mapping
 * device <-> virtual port number becomes 1:1. Why? to simplify the
 * life of the device connection logic in
 * drivers/usb/wusbcore/devconnect.c. When we do the initial secret
 * handshake we need to assign a temporary address in the unauthorized
 * space. For simplicity we use the first virtual port number found to
 * be free [drivers/usb/wusbcore/devconnect.c:wusbhc_devconnect_ack()]
 * and that becomes it's address [X < 128] or its unauthorized address
 * [X | 0x80].
 *
 * We add 1 as an offset to the one-based USB-stack port number
 * (zero-based wusb virtual port index) for two reasons: (a) dev addr
 * 0 is reserved by USB for default address; (b) Linux's USB stack
 * uses always #1 for the root hub of the controller. So USB stack's
 * port #1, which is wusb virtual-port #0 has address #2.
 *
 * Devices connected under xHCI are not as simple.  The host controller
 * supports virtualization, so the hardware assigns device addresses and
 * the HCD must setup data structures before issuing a set address
 * command to the hardware.
 */
static void choose_devnum(struct usb_device *udev)
{
    int     devnum;
    struct usb_bus  *bus = udev->bus;

    /* If khubd ever becomes multithreaded, this will need a lock */
    if (0) {    // (udev->wusb) {
        devnum = udev->portnum + 1;
        // BUG_ON(test_bit(devnum, bus->devmap.devicemap));
    } else {
        /* Try to allocate the next devnum beginning at
         * bus->devnum_next. */
        devnum = find_next_zero_bit(bus->devmap.devicemap, 128,
                                    bus->devnum_next);
        if (devnum >= 128)
            devnum = find_next_zero_bit(bus->devmap.devicemap,
                                        128, 1);
        bus->devnum_next = ( devnum >= 127 ? 1 : devnum + 1);
    }
    if (devnum < 128) {
        set_bit(devnum, bus->devmap.devicemap);
        udev->devnum = devnum;
    }
}

static void release_devnum(struct usb_device *udev)
{
    if (udev->devnum > 0) {
        clear_bit(udev->devnum, udev->bus->devmap.devicemap);
        udev->devnum = -1;
    }
}

static void update_devnum(struct usb_device *udev, int devnum)
{
    /* The address for a WUSB device is managed by wusbcore. */
    //if (!udev->wusb)
    udev->devnum = devnum;
}

static void hub_free_dev(struct usb_device *udev)
{
    struct usb_hcd *hcd = bus_to_hcd(udev->bus);

    /* Root hubs aren't real devices, so don't free HCD resources */
    if (hcd->driver->free_dev && udev->parent)
        hcd->driver->free_dev(hcd, udev);
}

/**
 * usb_disconnect - disconnect a device (usbcore-internal)
 * @pdev: pointer to device being disconnected
 * Context: !in_interrupt ()
 *
 * Something got disconnected. Get rid of it and all of its children.
 *
 * If *pdev is a normal device then the parent hub must already be locked.
 * If *pdev is a root hub then this routine will acquire the
 * usb_bus_list_lock on behalf of the caller.
 *
 * Only hub drivers (including virtual root hub drivers for host
 * controllers) should ever call this.
 *
 * This call is synchronous, and may not be used in an interrupt context.
 */
void usb_disconnect(struct usb_device **pdev)
{
    struct usb_device   *udev = *pdev;
    int         i;
    //struct usb_hcd        *hcd = bus_to_hcd(udev->bus);

    /* mark the device as inactive, so any further urb submissions for
     * this device (and any of its children) will fail immediately.
     * this quiesces everything except pending urbs.
     */
    usb_set_device_state(udev, USB_STATE_NOTATTACHED);
    USB_debug("USB disconnect, device number %d\n", udev->devnum);

    usb_lock_device(udev);

    /* Free up all the children before we remove this device */
    for (i = 0; i < USB_MAXCHILDREN; i++) {
        if (udev->children[i])
            usb_disconnect(&udev->children[i]);
    }

    /* deallocate hcd/hardware state ... nuking all pending urbs and
     * cleaning up all state associated with the current configuration
     * so that the hardware is now fully quiesced.
     */
    mutex_lock(hcd->bandwidth_mutex);
    usb_disable_device(udev, 0);
    mutex_unlock(hcd->bandwidth_mutex);
    usb_hcd_synchronize_unlinks(udev);

    usb_remove_ep_devs(&udev->ep0);
    usb_unlock_device(udev);

    /* Unregister the device.  The device driver is responsible
     * for de-configuring the device and invoking the remove-device
     * notifier chain (used by usbfs and possibly others).
     */
    //device_del(&udev->dev);

    /* Free the device number and delete the parent's children[]
     * (or root_hub) pointer.
     */
    release_devnum(udev);

    /* Avoid races with recursively_mark_NOTATTACHED() */
    spin_lock_irq(&device_state_lock);
    *pdev = NULL;
    spin_unlock_irq(&device_state_lock);

    hub_free_dev(udev);

    //put_device(&udev->dev);
    usb_deauthorize_device(udev);
    kfree(udev->dev.p);
    kfree(udev);
}

#if 1 //#ifdef CONFIG_USB_ANNOUNCE_NEW_DEVICES
static void show_string(struct usb_device *udev, char *id, char *string)
{
    if (!string)
        return;
    USB_debug("%s: %s\n", id, string);
}

static void announce_device(struct usb_device *udev)
{
    USB_debug("New USB device found dev=0x%x, udev=0x%x, state=%d, idVendor=0x%x, idProduct=0x%x\n",
              (int)&udev->dev, (int)udev, udev->state,
              le16_to_cpu(udev->descriptor.idVendor),
              le16_to_cpu(udev->descriptor.idProduct));
    USB_vdebug("New USB device strings: Mfr=0x%x, Product=0x%x, SerialNumber=0x%x\n",
               udev->descriptor.iManufacturer,
               udev->descriptor.iProduct,
               udev->descriptor.iSerialNumber);
    show_string(udev, "Product", udev->product);
    show_string(udev, "Manufacturer", udev->manufacturer);
    show_string(udev, "SerialNumber", udev->serial);
}
#else
static inline void announce_device(struct usb_device *udev) { }
#endif

