OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
#ifdef  CONFIG_USB_OTG
#include "otg_whitelist.h"
#endif

/**
 * usb_enumerate_device_otg - FIXME (usbcore-internal)
 * @udev: newly addressed device (in ADDRESS state)
 *
 * Finish enumeration for On-The-Go devices
 */
static int usb_enumerate_device_otg(struct usb_device *udev)
{
    int err = 0;

#ifdef  CONFIG_USB_OTG
    /*
     * OTG-aware devices on OTG-capable root hubs may be able to use SRP,
     * to wake us after we've powered off VBUS; and HNP, switching roles
     * "host" to "peripheral".  The OTG descriptor helps figure this out.
     */
    if (!udev->bus->is_b_host
            && udev->config
            && udev->parent == udev->bus->root_hub) {
        struct usb_otg_descriptor   *desc = NULL;
        struct usb_bus          *bus = udev->bus;

        /* descriptor may appear anywhere in config */
        if (__usb_get_extra_descriptor (udev->rawdescriptors[0],
                                        le16_to_cpu(udev->config[0].desc.wTotalLength),
                                        USB_DT_OTG, (void **) &desc) == 0) {
            if (desc->bmAttributes & USB_OTG_HNP) {
                unsigned        port1 = udev->portnum;

                USB_debug("Dual-Role OTG device on %sHNP port\n",
                          (port1 == bus->otg_port) ? "" : "non-");

                /* enable HNP before suspend, it's simpler */
                if (port1 == bus->otg_port)
                    bus->b_hnp_enable = 1;
                err = usb_control_msg(udev,
                                      usb_sndctrlpipe(udev, 0),
                                      USB_REQ_SET_FEATURE, 0,
                                      bus->b_hnp_enable
                                      ? USB_DEVICE_B_HNP_ENABLE
                                      : USB_DEVICE_A_ALT_HNP_SUPPORT,
                                      0, NULL, 0, USB_CTRL_SET_TIMEOUT);
                if (err < 0) {
                    /* OTG MESSAGE: report errors here,
                     * customize to match your product.
                     */
                    USB_debug("can't set HNP mode: %d\n", err);
                    bus->b_hnp_enable = 0;
                }
            }
        }
    }

    if (!is_targeted(udev)) {

        /* Maybe it can talk to us, though we can't talk to it.
         * (Includes HNP test device.)
         */
        if (udev->bus->b_hnp_enable || udev->bus->is_b_host) {
            err = usb_port_suspend(udev, PMSG_SUSPEND);
            if (err < 0)
                USB_debug("HNP fail, %d\n", err);
        }
        err = -ENOTSUPP;
        goto fail;
    }
fail:
#endif
    return err;
}


/**
 * usb_enumerate_device - Read device configs/intfs/otg (usbcore-internal)
 * @udev: newly addressed device (in ADDRESS state)
 *
 * This is only called by usb_new_device() and usb_authorize_device()
 * and FIXME -- all comments that apply to them apply here wrt to
 * environment.
 *
 * If the device is WUSB and not authorized, we don't attempt to read
 * the string descriptors, as they will be errored out by the device
 * until it has been authorized.
 */
static int usb_enumerate_device(struct usb_device *udev)
{
    int err;

    if (udev->config == NULL) {
        err = usb_get_configuration(udev);
        if (err < 0) {
            USB_error("can't read configurations, error %d\n",
                      err);
            goto fail;
        }
    }

    /* read the standard strings and cache them if present */
    udev->product = usb_cache_string(udev, udev->descriptor.iProduct);
    udev->manufacturer = usb_cache_string(udev,
                                          udev->descriptor.iManufacturer);
    udev->serial = usb_cache_string(udev, udev->descriptor.iSerialNumber);

    err = usb_enumerate_device_otg(udev);
fail:
    return err;
}


/**
 * usb_new_device - perform initial device setup (usbcore-internal)
 * @udev: newly addressed device (in ADDRESS state)
 *
 * This is called with devices which have been detected but not fully
 * enumerated.  The device descriptor is available, but not descriptors
 * for any device configuration.  The caller must have locked either
 * the parent hub (if udev is a normal device) or else the
 * usb_bus_list_lock (if udev is a root hub).  The parent's pointer to
 * udev has already been installed, but udev is not yet visible through
 * sysfs or other filesystem code.
 *
 * It will return if the device is configured properly or not.  Zero if
 * the interface was registered with the driver core; else a negative
 * errno value.
 *
 * This call is synchronous, and may not be used in an interrupt context.
 *
 * Only the hub driver or root-hub registrar should ever call this.
 */
#ifdef TEST_OTG
struct usb_device  *gOTG_Dev_pet = NULL;
#endif
int usb_new_device(struct usb_device *udev)
{
    int err;

    if (udev->parent) {
        /* Initialize non-root-hub device wakeup to disabled;
         * device (un)configuration controls wakeup capable
         * sysfs power/wakeup controls wakeup enabled/disabled
         */
        //device_init_wakeup(&udev->dev, 0);
    }

    /* Tell the runtime-PM framework the device is active */
    //pm_runtime_set_active(&udev->dev);
    //pm_runtime_get_noresume(&udev->dev);
    //pm_runtime_use_autosuspend(&udev->dev);
    //pm_runtime_enable(&udev->dev);

    /* By default, forbid autosuspend for all devices.  It will be
     * allowed for hubs during binding.
     */
    usb_disable_autosuspend(udev);

    err = usb_enumerate_device(udev);   /* Read descriptors */
    if (err < 0)
        goto fail;
    USB_debug("udev %d, busnum %d, minor = %d\n",
              udev->devnum, udev->bus->busnum,
              (((udev->bus->busnum-1) * 128) + (udev->devnum-1)));
    /* export the usbdev device-node for libusb */
    //udev->dev.devt = MKDEV(USB_DEVICE_MAJOR,
    //      (((udev->bus->busnum-1) * 128) + (udev->devnum-1)));

    /* Tell the world! */
    announce_device(udev);

#ifdef NUVOTON_PORTED
#ifdef TEST_OTG
    gOTG_Dev_pet = udev;
#endif
    if (usb_set_configuration(udev, 1) < 0) {
        USB_error("usb_set_configuration failed!!\n");
    }

    // enable remote wakeup
    if (usb_control_msg(udev, usb_sndctrlpipe(udev, 0),
                        USB_REQ_SET_FEATURE, 0x00, 0x0001, 0x0000, NULL, 0x0000,
                        USB_CTRL_SET_TIMEOUT)) {
        USB_error("Failed to enable remote wakeup, maybe not supported.\n");
    }

#endif

    //device_enable_async_suspend(&udev->dev);
    /* Register the device.  The device driver is responsible
     * for configuring the device and invoking the add-device
     * notifier chain (used by usbfs and possibly others).
     */

    err = device_add(&udev->dev);
    if (err) {
        USB_error("can't device_add, error %d\n", err);
        goto fail;
    }

