OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
    (void) usb_create_ep_devs(&udev->dev, &udev->ep0, udev);
    usb_mark_last_busy(udev);
    //pm_runtime_put_sync_autosuspend(&udev->dev);
    return err;

fail:
    usb_set_device_state(udev, USB_STATE_NOTATTACHED);
    //pm_runtime_disable(&udev->dev);
    //pm_runtime_set_suspended(&udev->dev);
    return err;
}


/**
 * usb_deauthorize_device - deauthorize a device (usbcore-internal)
 * @usb_dev: USB device
 *
 * Move the USB device to a very basic state where interfaces are disabled
 * and the device is in fact unconfigured and unusable.
 *
 * We share a lock (that we have) with device_del(), so we need to
 * defer its call.
 */
int usb_deauthorize_device(struct usb_device *usb_dev)
{
    usb_lock_device(usb_dev);
    if (usb_dev->authorized == 0)
        goto out_unauthorized;

    usb_dev->authorized = 0;
    usb_set_configuration(usb_dev, -1);

    kfree(usb_dev->product);
    usb_dev->product = NULL;    // kstrdup("n/a (unauthorized)", GFP_KERNEL);
    kfree(usb_dev->manufacturer);
    usb_dev->manufacturer = NULL;   // kstrdup("n/a (unauthorized)", GFP_KERNEL);
    kfree(usb_dev->serial);
    usb_dev->serial = NULL;     // kstrdup("n/a (unauthorized)", GFP_KERNEL);

    usb_release_bos_descriptor(usb_dev);
    usb_destroy_configuration(usb_dev);
    usb_dev->descriptor.bNumConfigurations = 0;

out_unauthorized:
    usb_unlock_device(usb_dev);
    return 0;
}

int usb_authorize_device(struct usb_device *usb_dev)
{
    int result = 0, c;

    usb_lock_device(usb_dev);
    if (usb_dev->authorized == 1)
        goto out_authorized;

    result = usb_autoresume_device(usb_dev);
    if (result < 0) {
        USB_error("can't autoresume for authorization: %d\n", result);
        goto error_autoresume;
    }
    result = usb_get_device_descriptor(usb_dev, sizeof(usb_dev->descriptor));
    if (result < 0) {
        USB_error("can't re-read device descriptor for authorization: %d\n", result);
        goto error_device_descriptor;
    }

    kfree(usb_dev->product);
    usb_dev->product = NULL;
    kfree(usb_dev->manufacturer);
    usb_dev->manufacturer = NULL;
    kfree(usb_dev->serial);
    usb_dev->serial = NULL;

    usb_dev->authorized = 1;
    result = usb_enumerate_device(usb_dev);
    if (result < 0)
        goto error_enumerate;
    /* Choose and set the configuration.  This registers the interfaces
     * with the driver core and lets interface drivers bind to them.
     */
    c = usb_choose_configuration(usb_dev);
    if (c >= 0) {
        result = usb_set_configuration(usb_dev, c);
        if (result) {
            USB_error("can't set config #%d, error %d\n", c, result);
            /* This need not be fatal.  The user can try to
             * set other configurations. */
        }
    }
    USB_vdebug("authorized to connect\n");

error_enumerate:
error_device_descriptor:
    usb_autosuspend_device(usb_dev);
error_autoresume:
out_authorized:
    usb_unlock_device(usb_dev); // complements locktree
    return result;
}


#if 0
/* Returns 1 if @hub is a WUSB root hub, 0 otherwise */
static unsigned hub_is_wusb(struct usb_hub *hub)
{
    struct usb_hcd *hcd;
    if (hub->hdev->parent != NULL)  /* not a root hub? */
        return 0;
    hcd = container_of(hub->hdev->bus, struct usb_hcd, self);
    return hcd->wireless;
}
#endif

#ifdef TEST_OTG
#define PORT_RESET_TRIES	1
#define SET_ADDRESS_TRIES	2
#define GET_DESCRIPTOR_TRIES	2
#define SET_CONFIG_TRIES	(2 * (use_both_schemes))
#define USE_NEW_SCHEME(i)	((i) / 2 == old_scheme_first)

#define HUB_ROOT_RESET_TIME	    100	/* times are in msec */
#define HUB_SHORT_RESET_TIME	10
#define HUB_BH_RESET_TIME	    10
#define HUB_LONG_RESET_TIME	    10
#define HUB_RESET_TIMEOUT	    10

#else

#define PORT_RESET_TRIES    5
#define SET_ADDRESS_TRIES   2
#define GET_DESCRIPTOR_TRIES    2
#define SET_CONFIG_TRIES    (2 * (use_both_schemes + 1))
#define USE_NEW_SCHEME(i)   ((i) / 2 == old_scheme_first)

#define HUB_ROOT_RESET_TIME 1000    /* times are in msec */
#define HUB_SHORT_RESET_TIME    1000
#define HUB_BH_RESET_TIME   1000
#define HUB_LONG_RESET_TIME 5000
#define HUB_RESET_TIMEOUT   20000
#endif

static int hub_port_reset(struct usb_hub *hub, int port1,
                          struct usb_device *udev, unsigned int delay, bool warm);

/* Is a USB 3.0 port in the Inactive state? */
static bool hub_port_inactive(struct usb_hub *hub, u16 portstatus)
{
    return hub_is_superspeed(hub->hdev) &&
           (portstatus & USB_PORT_STAT_LINK_STATE) ==
           USB_SS_PORT_LS_SS_INACTIVE;
}

static int hub_port_wait_reset(struct usb_hub *hub, int port1,
                               struct usb_device *udev, unsigned int delay, bool warm)
{
    int delay_time, ret;
    u16 portstatus;
    u16 portchange;

    for (delay_time = 0;
            delay_time < HUB_RESET_TIMEOUT;
            delay_time += delay) {
        /* wait to give the device a chance to reset */
        msleep(delay);

        /* read and decode port status */
        ret = hub_port_status(hub, port1, &portstatus, &portchange);
        if (ret < 0)
            return ret;

        /*
         * Some buggy devices require a warm reset to be issued even
         * when the port appears not to be connected.
         */
        if (!warm) {
            /*
             * Some buggy devices can cause an NEC host controller
             * to transition to the "Error" state after a hot port
             * reset.  This will show up as the port state in
             * "Inactive", and the port may also report a
             * disconnect.  Forcing a warm port reset seems to make
             * the device work.
             *
             * See https://bugzilla.kernel.org/show_bug.cgi?id=41752
             */
            if (hub_port_inactive(hub, portstatus)) {
                int ret;

                if ((portchange & USB_PORT_STAT_C_CONNECTION))
                    clear_port_feature(hub->hdev, port1,
                                       USB_PORT_FEAT_C_CONNECTION);
                if (portchange & USB_PORT_STAT_C_LINK_STATE)
                    clear_port_feature(hub->hdev, port1,
                                       USB_PORT_FEAT_C_PORT_LINK_STATE);
                if (portchange & USB_PORT_STAT_C_RESET)
                    clear_port_feature(hub->hdev, port1,
                                       USB_PORT_FEAT_C_RESET);
                USB_debug("hot reset failed, warm reset port %d\n",
                          port1);
                ret = hub_port_reset(hub, port1,
                                     udev, HUB_BH_RESET_TIME,
                                     true);
                if ((portchange & USB_PORT_STAT_C_CONNECTION))
                    clear_port_feature(hub->hdev, port1,
                                       USB_PORT_FEAT_C_CONNECTION);
                return ret;
            }
            /* Device went away? */
            if (!(portstatus & USB_PORT_STAT_CONNECTION))
                return -ENOTCONN;

            /* bomb out completely if the connection bounced */
            if ((portchange & USB_PORT_STAT_C_CONNECTION))
                return -ENOTCONN;

            /* if we`ve finished resetting, then break out of
             * the loop
             */
            if (!(portstatus & USB_PORT_STAT_RESET) &&
                    (portstatus & USB_PORT_STAT_ENABLE)) {
                if (0)  //(hub_is_wusb(hub))
                    udev->speed = USB_SPEED_WIRELESS;
                else if (hub_is_superspeed(hub->hdev))
                    udev->speed = USB_SPEED_SUPER;
                else if (portstatus & USB_PORT_STAT_HIGH_SPEED)
                    udev->speed = USB_SPEED_HIGH;
                else if (portstatus & USB_PORT_STAT_LOW_SPEED)
                    udev->speed = USB_SPEED_LOW;
                else
                    udev->speed = USB_SPEED_FULL;
                return 0;
            }
        } else {
            if (portchange & USB_PORT_STAT_C_BH_RESET)
                return 0;
        }

        /* switch to the long delay after two short delay failures */
        if (delay_time >= 2 * HUB_SHORT_RESET_TIME)
            delay = HUB_LONG_RESET_TIME;

        USB_debug("port %d not %s reset yet, waiting %dms\n",
                  port1, warm ? "warm " : "", delay);
    }

    return -EBUSY;
}

