OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
static void hub_port_finish_reset(struct usb_hub *hub, int port1,
                                  struct usb_device *udev, int *status, bool warm)
{
    switch (*status) {
    case 0:
        if (!warm) {
            struct usb_hcd *hcd;
            /* TRSTRCY = 10 ms; plus some extra */
            msleep(10 + 40);
            update_devnum(udev, 0);
            hcd = bus_to_hcd(udev->bus);
            if (hcd->driver->reset_device) {
                *status = hcd->driver->reset_device(hcd, udev);
                if (*status < 0) {
                    USB_error("Cannot reset HCD device state\n");
                    break;
                }
            }
        }
    /* FALL THROUGH */
    case -ENOTCONN:
    case -ENODEV:
        clear_port_feature(hub->hdev,
                           port1, USB_PORT_FEAT_C_RESET);
        /* FIXME need disconnect() for NOTATTACHED device */
        if (warm) {
            clear_port_feature(hub->hdev, port1,
                               USB_PORT_FEAT_C_BH_PORT_RESET);
            clear_port_feature(hub->hdev, port1,
                               USB_PORT_FEAT_C_PORT_LINK_STATE);
        } else {
            usb_set_device_state(udev, *status
                                 ? USB_STATE_NOTATTACHED
                                 : USB_STATE_DEFAULT);
        }
        break;
    }
}

/* Handle port reset and port warm(BH) reset (for USB3 protocol ports) */
static int hub_port_reset(struct usb_hub *hub, int port1,
                          struct usb_device *udev, unsigned int delay, bool warm)
{
    int i, status;

    if (!warm) {
        /* Block EHCI CF initialization during the port reset.
         * Some companion controllers don't like it when they mix.
         */
        //down_read(&ehci_cf_port_reset_rwsem);
    } else {
        if (!hub_is_superspeed(hub->hdev)) {
            USB_error("only USB3 hub support warm reset\n");
            return -EINVAL;
        }
    }

    /* Reset the port */
    for (i = 0; i < PORT_RESET_TRIES; i++) {
        status = set_port_feature(hub->hdev, port1, (warm ?
                                  USB_PORT_FEAT_BH_PORT_RESET :
                                  USB_PORT_FEAT_RESET));
        if (status) {
            USB_error("cannot %sreset port %d (err = %d)\n",
                      warm ? "warm " : "", port1, status);
        } else {
            status = hub_port_wait_reset(hub, port1, udev, delay,
                                         warm);
            if (status && status != -ENOTCONN)
                USB_debug("port_wait_reset: err = %d\n", status);
        }

        /* return on disconnect or reset */
        if (status == 0 || status == -ENOTCONN || status == -ENODEV) {
            hub_port_finish_reset(hub, port1, udev, &status, warm);
            goto done;
        }

        USB_debug("port %d not enabled, trying %sreset again...\n",
                  port1, warm ? "warm " : "");
        delay = HUB_LONG_RESET_TIME;
    }

    USB_error("Cannot enable port %i.  Maybe the USB cable is bad?\n", port1);

done:
    //if (!warm)
    //  up_read(&ehci_cf_port_reset_rwsem);

    return status;
}

/* Check if a port is power on */
static int port_is_power_on(struct usb_hub *hub, unsigned portstatus)
{
    int ret = 0;

    if (hub_is_superspeed(hub->hdev)) {
        if (portstatus & USB_SS_PORT_STAT_POWER)
            ret = 1;
    } else {
        if (portstatus & USB_PORT_STAT_POWER)
            ret = 1;
    }

    return ret;
}

#ifdef  CONFIG_PM

/* Check if a port is suspended(USB2.0 port) or in U3 state(USB3.0 port) */
static int port_is_suspended(struct usb_hub *hub, unsigned portstatus)
{
    int ret = 0;

    if (hub_is_superspeed(hub->hdev)) {
        if ((portstatus & USB_PORT_STAT_LINK_STATE)
                == USB_SS_PORT_LS_U3)
            ret = 1;
    } else {
        if (portstatus & USB_PORT_STAT_SUSPEND)
            ret = 1;
    }

    return ret;
}

/* Determine whether the device on a port is ready for a normal resume,
 * is ready for a reset-resume, or should be disconnected.
 */
static int check_port_resume_type(struct usb_device *udev,
                                  struct usb_hub *hub, int port1,
                                  int status, unsigned portchange, unsigned portstatus)
{
    /* Is the device still present? */
    if (status || port_is_suspended(hub, portstatus) ||
            !port_is_power_on(hub, portstatus) ||
            !(portstatus & USB_PORT_STAT_CONNECTION)) {
        if (status >= 0)
            status = -ENODEV;
    }

    /* Can't do a normal resume if the port isn't enabled,
     * so try a reset-resume instead.
     */
    else if (!(portstatus & USB_PORT_STAT_ENABLE) && !udev->reset_resume) {
        if (udev->persist_enabled)
            udev->reset_resume = 1;
        else
            status = -ENODEV;
    }

    if (status) {
        USB_debug("port %d status %04x.%04x after resume, %d\n",
                  port1, portchange, portstatus, status);
    } else if (udev->reset_resume) {

        /* Late port handoff can set status-change bits */
        if (portchange & USB_PORT_STAT_C_CONNECTION)
            clear_port_feature(hub->hdev, port1,
                               USB_PORT_FEAT_C_CONNECTION);
        if (portchange & USB_PORT_STAT_C_ENABLE)
            clear_port_feature(hub->hdev, port1,
                               USB_PORT_FEAT_C_ENABLE);
    }

    return status;
}

#ifdef  CONFIG_USB_SUSPEND

/*
 * usb_port_suspend - suspend a usb device's upstream port
 * @udev: device that's no longer in active use, not a root hub
 * Context: must be able to sleep; device not locked; pm locks held
 *
 * Suspends a USB device that isn't in active use, conserving power.
 * Devices may wake out of a suspend, if anything important happens,
 * using the remote wakeup mechanism.  They may also be taken out of
 * suspend by the host, using usb_port_resume().  It's also routine
 * to disconnect devices while they are suspended.
 *
 * This only affects the USB hardware for a device; its interfaces
 * (and, for hubs, child devices) must already have been suspended.
 *
 * Selective port suspend reduces power; most suspended devices draw
 * less than 500 uA.  It's also used in OTG, along with remote wakeup.
 * All devices below the suspended port are also suspended.
 *
 * Devices leave suspend state when the host wakes them up.  Some devices
 * also support "remote wakeup", where the device can activate the USB
 * tree above them to deliver data, such as a keypress or packet.  In
 * some cases, this wakes the USB host.
 *
 * Suspending OTG devices may trigger HNP, if that's been enabled
 * between a pair of dual-role devices.  That will change roles, such
 * as from A-Host to A-Peripheral or from B-Host back to B-Peripheral.
 *
 * Devices on USB hub ports have only one "suspend" state, corresponding
 * to ACPI D2, "may cause the device to lose some context".
 * State transitions include:
 *
 *   - suspend, resume ... when the VBUS power link stays live
 *   - suspend, disconnect ... VBUS lost
 *
 * Once VBUS drop breaks the circuit, the port it's using has to go through
 * normal re-enumeration procedures, starting with enabling VBUS power.
 * Other than re-initializing the hub (plug/unplug, except for root hubs),
 * Linux (2.6) currently has NO mechanisms to initiate that:  no khubd
 * timer, no SRP, no requests through sysfs.
 *
 * If CONFIG_USB_SUSPEND isn't enabled, devices only really suspend when
 * the root hub for their bus goes into global suspend ... so we don't
 * (falsely) update the device power state to say it suspended.
 *
 * Returns 0 on success, else negative errno.
 */
int usb_port_suspend(struct usb_device *udev, pm_message_t msg)
{
    struct usb_hub  *hub = hdev_to_hub(udev->parent);
    int     port1 = udev->portnum;
    int     status;

