OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
    /* enable remote wakeup when appropriate; this lets the device
     * wake up the upstream hub (including maybe the root hub).
     *
     * NOTE:  OTG devices may issue remote wakeup (or SRP) even when
     * we don't explicitly enable it here.
     */
    if (udev->do_remote_wakeup) {
        status = usb_control_msg(udev, usb_sndctrlpipe(udev, 0),
                                 USB_REQ_SET_FEATURE, USB_RECIP_DEVICE,
                                 USB_DEVICE_REMOTE_WAKEUP, 0,
                                 NULL, 0,
                                 USB_CTRL_SET_TIMEOUT);
        if (status) {
            USB_debug("won't remote wakeup, status %d\n", status);
            /* bail if autosuspend is requested */
            if (PMSG_IS_AUTO(msg))
                return status;
        }
    }

    /* disable USB2 hardware LPM */
    if (udev->usb2_hw_lpm_enabled == 1)
        usb_set_usb2_hardware_lpm(udev, 0);

    /* see 7.1.7.6 */
    if (hub_is_superspeed(hub->hdev))
        status = set_port_feature(hub->hdev,
                                  port1 | (USB_SS_PORT_LS_U3 << 3),
                                  USB_PORT_FEAT_LINK_STATE);
    else
        status = set_port_feature(hub->hdev, port1,
                                  USB_PORT_FEAT_SUSPEND);
    if (status) {
        USB_debug("can't suspend port %d, status %d\n", port1, status);
        /* paranoia:  "should not happen" */
        if (udev->do_remote_wakeup)
            (void) usb_control_msg(udev, usb_sndctrlpipe(udev, 0),
                                   USB_REQ_CLEAR_FEATURE, USB_RECIP_DEVICE,
                                   USB_DEVICE_REMOTE_WAKEUP, 0,
                                   NULL, 0,
                                   USB_CTRL_SET_TIMEOUT);

        /* System sleep transitions should never fail */
        if (!PMSG_IS_AUTO(msg))
            status = 0;
    } else {
        /* device has up to 10 msec to fully suspend */
        USB_debug("usb %ssuspend, wakeup %d\n", (PMSG_IS_AUTO(msg) ? "auto-" : ""),
                  udev->do_remote_wakeup);
        usb_set_device_state(udev, USB_STATE_SUSPENDED);
        msleep(10);
    }
    usb_mark_last_busy(hub->hdev);
    return status;
}

/*
 * If the USB "suspend" state is in use (rather than "global suspend"),
 * many devices will be individually taken out of suspend state using
 * special "resume" signaling.  This routine kicks in shortly after
 * hardware resume signaling is finished, either because of selective
 * resume (by host) or remote wakeup (by device) ... now see what changed
 * in the tree that's rooted at this device.
 *
 * If @udev->reset_resume is set then the device is reset before the
 * status check is done.
 */
static int finish_port_resume(struct usb_device *udev)
{
    int status = 0;
    u16 devstatus;

    /* caller owns the udev device lock */
    USB_debug(udev->reset_resume ? "finish reset-resume" : "finish resume");

    /* usb ch9 identifies four variants of SUSPENDED, based on what
     * state the device resumes to.  Linux currently won't see the
     * first two on the host side; they'd be inside hub_port_init()
     * during many timeouts, but khubd can't suspend until later.
     */
    usb_set_device_state(udev, udev->actconfig
                         ? USB_STATE_CONFIGURED
                         : USB_STATE_ADDRESS);

    /* 10.5.4.5 says not to reset a suspended port if the attached
     * device is enabled for remote wakeup.  Hence the reset
     * operation is carried out here, after the port has been
     * resumed.
     */
    if (udev->reset_resume)
retry_reset_resume:
        status = usb_reset_and_verify_device(udev);

    /* 10.5.4.5 says be sure devices in the tree are still there.
     * For now let's assume the device didn't go crazy on resume,
     * and device drivers will know about any resume quirks.
     */
    if (status == 0) {
        devstatus = 0;
        status = usb_get_status(udev, USB_RECIP_DEVICE, 0, &devstatus);
        if (status >= 0)
            status = (status > 0 ? 0 : -ENODEV);

        /* If a normal resume failed, try doing a reset-resume */
        if (status && !udev->reset_resume && udev->persist_enabled) {
            USB_debug("retry with reset-resume\n");
            udev->reset_resume = 1;
            goto retry_reset_resume;
        }
    }

    if (status) {
        USB_debug("gone after usb resume? status %d\n", status);
    } else if (udev->actconfig) {
        le16_to_cpus(&devstatus);
        if (devstatus & (1 << USB_DEVICE_REMOTE_WAKEUP)) {
            status = usb_control_msg(udev,
                                     usb_sndctrlpipe(udev, 0),
                                     USB_REQ_CLEAR_FEATURE,
                                     USB_RECIP_DEVICE,
                                     USB_DEVICE_REMOTE_WAKEUP, 0,
                                     NULL, 0,
                                     USB_CTRL_SET_TIMEOUT);
            if (status)
                USB_debug("disable remote wakeup, status %d\n", status);
        }
        status = 0;
    }
    return status;
}

/*
 * usb_port_resume - re-activate a suspended usb device's upstream port
 * @udev: device to re-activate, not a root hub
 * Context: must be able to sleep; device not locked; pm locks held
 *
 * This will re-activate the suspended device, increasing power usage
 * while letting drivers communicate again with its endpoints.
 * USB resume explicitly guarantees that the power session between
 * the host and the device is the same as it was when the device
 * suspended.
 *
 * If @udev->reset_resume is set then this routine won't check that the
 * port is still enabled.  Furthermore, finish_port_resume() above will
 * reset @udev.  The end result is that a broken power session can be
 * recovered and @udev will appear to persist across a loss of VBUS power.
 *
 * For example, if a host controller doesn't maintain VBUS suspend current
 * during a system sleep or is reset when the system wakes up, all the USB
 * power sessions below it will be broken.  This is especially troublesome
 * for mass-storage devices containing mounted filesystems, since the
 * device will appear to have disconnected and all the memory mappings
 * to it will be lost.  Using the USB_PERSIST facility, the device can be
 * made to appear as if it had not disconnected.
 *
 * This facility can be dangerous.  Although usb_reset_and_verify_device() makes
 * every effort to insure that the same device is present after the
 * reset as before, it cannot provide a 100% guarantee.  Furthermore it's
 * quite possible for a device to remain unaltered but its media to be
 * changed.  If the user replaces a flash memory card while the system is
 * asleep, he will have only himself to blame when the filesystem on the
 * new card is corrupted and the system crashes.
 *
 * Returns 0 on success, else negative errno.
 */
int usb_port_resume(struct usb_device *udev, pm_message_t msg)
{
    struct usb_hub  *hub = hdev_to_hub(udev->parent);
    int     port1 = udev->portnum;
    int     status;
    u16     portchange, portstatus;

