OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
    /* Skip the initial Clear-Suspend step for a remote wakeup */
    status = hub_port_status(hub, port1, &portstatus, &portchange);
    if (status == 0 && !port_is_suspended(hub, portstatus))
        goto SuspendCleared;

    USB_debug("resume port %d\n", port1);

    set_bit(port1, hub->busy_bits);

    /* see 7.1.7.7; affects power usage, but not budgeting */
    if (hub_is_superspeed(hub->hdev))
        status = set_port_feature(hub->hdev,
                                  port1 | (USB_SS_PORT_LS_U0 << 3),
                                  USB_PORT_FEAT_LINK_STATE);
    else
        status = clear_port_feature(hub->hdev,
                                    port1, USB_PORT_FEAT_SUSPEND);
    if (status) {
        USB_debug("can't resume port %d, status %d\n", port1, status);
    } else {
        /* drive resume for at least 20 msec */
        USB_debug("usb %sresume\n", (PMSG_IS_AUTO(msg) ? "auto-" : ""));
        msleep(25);

        /* Virtual root hubs can trigger on GET_PORT_STATUS to
         * stop resume signaling.  Then finish the resume
         * sequence.
         */
        status = hub_port_status(hub, port1, &portstatus, &portchange);

        /* TRSMRCY = 10 msec */
        msleep(10);
    }

SuspendCleared:
    if (status == 0) {
        if (hub_is_superspeed(hub->hdev)) {
            if (portchange & USB_PORT_STAT_C_LINK_STATE)
                clear_port_feature(hub->hdev, port1,
                                   USB_PORT_FEAT_C_PORT_LINK_STATE);
        } else {
            if (portchange & USB_PORT_STAT_C_SUSPEND)
                clear_port_feature(hub->hdev, port1,
                                   USB_PORT_FEAT_C_SUSPEND);
        }
    }

    clear_bit(port1, hub->busy_bits);

    status = check_port_resume_type(udev,
                                    hub, port1, status, portchange, portstatus);
    if (status == 0)
        status = finish_port_resume(udev);
    if (status < 0) {
        USB_debug("can't resume, status %d\n", status);
        hub_port_logical_disconnect(hub, port1);
    } else  {
        /* Try to enable USB2 hardware LPM */
        if (udev->usb2_hw_lpm_capable == 1)
            usb_set_usb2_hardware_lpm(udev, 1);
    }

    return status;
}

/* caller has locked udev */
int usb_remote_wakeup(struct usb_device *udev)
{
    int status = 0;

    if (udev->state == USB_STATE_SUSPENDED) {
        USB_debug("usb %sresume\n", "wakeup-");
        status = usb_autoresume_device(udev);
        if (status == 0) {
            /* Let the drivers do their thing, then... */
            usb_autosuspend_device(udev);
        }
    }
    return status;
}

#else   /* CONFIG_USB_SUSPEND */

/* When CONFIG_USB_SUSPEND isn't set, we never suspend or resume any ports. */

int usb_port_suspend(struct usb_device *udev, pm_message_t msg)
{
    return 0;
}

/* However we may need to do a reset-resume */

int usb_port_resume(struct usb_device *udev, pm_message_t msg)
{
    struct usb_hub  *hub = hdev_to_hub(udev->parent);
    int     port1 = udev->portnum;
    int     status;
    u16     portchange, portstatus;

    status = hub_port_status(hub, port1, &portstatus, &portchange);
    status = check_port_resume_type(udev,
                                    hub, port1, status, portchange, portstatus);

    if (status) {
        USB_debug("can't resume, status %d\n", status);
        hub_port_logical_disconnect(hub, port1);
    } else if (udev->reset_resume) {
        USB_debug("reset-resume\n");
        status = usb_reset_and_verify_device(udev);
    }
    return status;
}

#endif

static int hub_suspend(struct usb_interface *intf, pm_message_t msg)
{
    struct usb_hub      *hub = usb_get_intfdata (intf);
    struct usb_device   *hdev = hub->hdev;
    unsigned        port1;

    /* Warn if children aren't already suspended */
    for (port1 = 1; port1 <= hdev->maxchild; port1++) {
        struct usb_device   *udev;

        udev = hdev->children [port1-1];
        if (udev && udev->can_submit) {
            USB_error("port %d nyet suspended\n", port1);
            if (PMSG_IS_AUTO(msg))
                return -EBUSY;
        }
    }

    USB_debug("%s\n", __func__);

    /* stop khubd and related activity */
    hub_quiesce(hub, HUB_SUSPEND);
    return 0;
}

static int hub_resume(struct usb_interface *intf)
{
    struct usb_hub *hub = usb_get_intfdata(intf);

    USB_debug("%s\n", __func__);
    hub_activate(hub, HUB_RESUME);
    return 0;
}

static int hub_reset_resume(struct usb_interface *intf)
{
    struct usb_hub *hub = usb_get_intfdata(intf);

    USB_debug("%s\n", __func__);
    hub_activate(hub, HUB_RESET_RESUME);
    return 0;
}

/**
 * usb_root_hub_lost_power - called by HCD if the root hub lost Vbus power
 * @rhdev: struct usb_device for the root hub
 *
 * The USB host controller driver calls this function when its root hub
 * is resumed and Vbus power has been interrupted or the controller
 * has been reset.  The routine marks @rhdev as having lost power.
 * When the hub driver is resumed it will take notice and carry out
 * power-session recovery for all the "USB-PERSIST"-enabled child devices;
 * the others will be disconnected.
 */
void usb_root_hub_lost_power(struct usb_device *rhdev)
{
    USB_error("root hub lost power or was reset\n");
    rhdev->reset_resume = 1;
}

#else   /* CONFIG_PM */

#define hub_suspend     NULL
#define hub_resume      NULL
#define hub_reset_resume    NULL
#endif


/* USB 2.0 spec, 7.1.7.3 / fig 7-29:
 *
 * Between connect detection and reset signaling there must be a delay
 * of 100ms at least for debounce and power-settling.  The corresponding
 * timer shall restart whenever the downstream port detects a disconnect.
 *
 * Apparently there are some bluetooth and irda-dongles and a number of
 * low-speed devices for which this debounce period may last over a second.
 * Not covered by the spec - but easy to deal with.
 *
 * This implementation uses a 1500ms total debounce timeout; if the
 * connection isn't stable by then it returns -ETIMEDOUT.  It checks
 * every 25ms for transient disconnects.  When the port status has been
 * unchanged for 100ms it returns the port status.
 */
static int hub_port_debounce(struct usb_hub *hub, int port1)
{
    int ret;
    int total_time, stable_time = 0;
    u16 portchange, portstatus;
    unsigned connection = 0xffff;

    for (total_time = 0; ; total_time += HUB_DEBOUNCE_STEP) {
        ret = hub_port_status(hub, port1, &portstatus, &portchange);
        if (ret < 0)
            return ret;

        if (!(portchange & USB_PORT_STAT_C_CONNECTION) &&
                (portstatus & USB_PORT_STAT_CONNECTION) == connection) {
            stable_time += HUB_DEBOUNCE_STEP;
            if (stable_time >= HUB_DEBOUNCE_STABLE)
                break;
        } else {
            stable_time = 0;
            connection = portstatus & USB_PORT_STAT_CONNECTION;
        }

