OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
        /*
         * If device is WUSB, we already assigned an
         * unauthorized address in the Connect Ack sequence;
         * authorization will assign the final address.
         */
        if (1) {    // (udev->wusb == 0) {
            for (j = 0; j < SET_ADDRESS_TRIES; ++j) {
                retval = hub_set_address(udev, devnum);
                if (retval >= 0)
                    break;
                msleep(200);
            }
            if (retval < 0) {
                USB_error("device not accepting address %d, error %d\n", devnum, retval);
                goto fail;
            }
            if (udev->speed == USB_SPEED_SUPER) {
                devnum = udev->devnum;
                USB_debug("%s SuperSpeed USB device number %d\n",
                          (udev->config) ? "reset" : "new", devnum);
            }

            /* cope with hardware quirkiness:
             *  - let SET_ADDRESS settle, some device hardware wants it
             *  - read ep0 maxpacket even for high and low speed,
             */
            msleep(10);
            if (USE_NEW_SCHEME(retry_counter) && !(hcd->driver->flags & HCD_USB3))
                break;
        }

        retval = usb_get_device_descriptor(udev, 8);
        if (retval < 8) {
            USB_error("device descriptor read/8, error %d\n", retval);
            if (retval >= 0)
                retval = -EMSGSIZE;
        } else {
            retval = 0;
            break;
        }
    }
    if (retval)
        goto fail;

    if (udev->descriptor.bMaxPacketSize0 == 0xff ||
            udev->speed == USB_SPEED_SUPER)
        i = 512;
    else
        i = udev->descriptor.bMaxPacketSize0;
    if (usb_endpoint_maxp(&udev->ep0.desc) != i) {
        if (udev->speed == USB_SPEED_LOW ||
                !(i == 8 || i == 16 || i == 32 || i == 64)) {
            USB_error("Invalid ep0 maxpacket: %d\n", i);
            retval = -EMSGSIZE;
            goto fail;
        }
        if (udev->speed == USB_SPEED_FULL)
            USB_debug("ep0 maxpacket = %d\n", i);
        else
            USB_debug("Using ep0 maxpacket: %d\n", i);
        udev->ep0.desc.wMaxPacketSize = cpu_to_le16(i);
        usb_ep0_reinit(udev);
    }

    retval = usb_get_device_descriptor(udev, USB_DT_DEVICE_SIZE);
    if (retval < (signed)sizeof(udev->descriptor)) {
        USB_error("device descriptor read/all, error %d\n", retval);
        if (retval >= 0)
            retval = -ENOMSG;
        goto fail;
    }

    //if (udev->wusb == 0 && le16_to_cpu(udev->descriptor.bcdUSB) >= 0x0201) {
    if (le16_to_cpu(udev->descriptor.bcdUSB) >= 0x0201) {
        retval = usb_get_bos_descriptor(udev);
        if (!retval) {
            if (udev->bos->ext_cap && (USB_LPM_SUPPORT &
                                       le32_to_cpu(udev->bos->ext_cap->bmAttributes)))
                udev->lpm_capable = 1;
        }
    }

    retval = 0;
    /* notify HCD that we have a device connected and addressed */
    if (hcd->driver->update_device)
        hcd->driver->update_device(hcd, udev);
fail:
    if (retval) {
        hub_port_disable(hub, port1, 0);
        update_devnum(udev, devnum);    /* for disconnect processing */
    }
    mutex_unlock(&usb_address0_mutex);
    return retval;
}

static void
check_highspeed (struct usb_hub *hub, struct usb_device *udev, int port1)
{
    struct usb_qualifier_descriptor *qual;
    int             status;

    qual = kmalloc (sizeof *qual, GFP_KERNEL);
    if (qual == NULL)
        return;

    status = usb_get_descriptor (udev, USB_DT_DEVICE_QUALIFIER, 0,
                                 qual, sizeof *qual);
    if (status == sizeof *qual) {
        USB_debug("not running at top speed; connect to a high speed hub\n");
        /* hub LEDs are probably harder to miss than syslog */
        if (hub->has_indicators) {
            hub->indicator[port1-1] = INDICATOR_GREEN_BLINK;
            led_work(hub); // schedule_delayed_work (&hub->leds, 0);
        }
    }
    kfree(qual);
}

static unsigned
hub_power_remaining (struct usb_hub *hub)
{
    struct usb_device *hdev = hub->hdev;
    int remaining;
    int port1;

    if (!hub->limited_power)
        return 0;

    remaining = hdev->bus_mA - hub->descriptor->bHubContrCurrent;
    for (port1 = 1; port1 <= hdev->maxchild; ++port1) {
        struct usb_device   *udev = hdev->children[port1 - 1];
        int         delta;

        if (!udev)
            continue;

        /* Unconfigured devices may not use more than 100mA,
         * or 8mA for OTG ports */
        if (udev->actconfig)
            delta = udev->actconfig->desc.bMaxPower * 2;
        else if (port1 != udev->bus->otg_port || hdev->parent)
            delta = 100;
        else
            delta = 8;
        if (delta > hub->mA_per_port)
            USB_error("%dmA is over %umA budget for port %d!\n",
                      delta, hub->mA_per_port, port1);
        remaining -= delta;
    }
    if (remaining < 0) {
        USB_error("%dmA over power budget!\n",  - remaining);
        remaining = 0;
    }
    return remaining;
}

/* Handle physical or logical connection change events.
 * This routine is called when:
 *  a port connection-change occurs;
 *  a port enable-change occurs (often caused by EMI);
 *  usb_reset_and_verify_device() encounters changed descriptors (as from
 *      a firmware download)
 * caller already locked the hub
 */
static void hub_port_connect_change(struct usb_hub *hub, int port1,
                                    u16 portstatus, u16 portchange)
{
    struct usb_device *hdev = hub->hdev;
    //struct device *hub_dev = hub->intfdev;
    struct usb_hcd *hcd = bus_to_hcd(hdev->bus);
    unsigned wHubCharacteristics =
        le16_to_cpu(hub->descriptor->wHubCharacteristics);
    struct usb_device *udev;
    int status, i;

    USB_debug("hub_port_connect_change - port %d, status %04x, change %04x, %s\n",
              port1, portstatus, portchange, portspeed(hub, portstatus));

    if (hub->has_indicators) {
        set_port_led(hub, port1, HUB_LED_AUTO);
        hub->indicator[port1-1] = INDICATOR_AUTO;
    }

