OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
    /*
     *  We restart the list every time to avoid a deadlock with
     * deleting hubs downstream from this one. This should be
     * safe since we delete the hub from the event list.
     * Not the most efficient, but avoids deadlocks.
     */
    while (1) {
        /* Grab the first entry at the beginning of the list */
        spin_lock_irq(&hub_event_lock);
        if (list_empty(&hub_event_list)) {
            spin_unlock_irq(&hub_event_lock);
            break;
        }

        tmp = hub_event_list.next;
        list_del_init(tmp);

        hub = list_entry(tmp, struct usb_hub, event_list);
        //kref_get(&hub->kref);
        hub->kref++;
        spin_unlock_irq(&hub_event_lock);

        hdev = hub->hdev;
        hub_dev = hub->intfdev;
        intf = to_usb_interface_by_dev(hub_dev);    // to_usb_interface(hub_dev);
        USB_vdebug("state %d ports %d chg %04x evt %04x\n",
                   hdev->state, hub->descriptor
                   ? hub->descriptor->bNbrPorts
                   : 0,
                   /* NOTE: expects max 15 ports... */
                   (u16) hub->change_bits[0],
                   (u16) hub->event_bits[0]);

        /* Lock the device, then check to see if we were
         * disconnected while waiting for the lock to succeed. */
        usb_lock_device(hdev);
        if (unlikely(hub->disconnected))
            goto loop_disconnected;

        /* If the hub has died, clean up after it */
        if (hdev->state == USB_STATE_NOTATTACHED) {
            hub->error = -ENODEV;
            hub_quiesce(hub, HUB_DISCONNECT);
            goto loop;
        }

        /* Autoresume */
        ret = usb_autopm_get_interface(intf);
        if (ret) {
            USB_debug("Can't autoresume: %d\n", ret);
            goto loop;
        }

        /* If this is an inactive hub, do nothing */
        if (hub->quiescing)
            goto loop_autopm;

        if (hub->error) {
            USB_debug("resetting for error %d\n", hub->error);

            ret = usb_reset_device(hdev);
            if (ret) {
                USB_debug("error resetting hub: %d\n", ret);
                goto loop_autopm;
            }

            hub->nerrors = 0;
            hub->error = 0;
        }

        /* deal with port status changes */
        for (i = 1; i <= hub->descriptor->bNbrPorts; i++) {
            if (test_bit(i, hub->busy_bits))
                continue;
            connect_change = test_bit(i, hub->change_bits);
            if (!test_and_clear_bit(i, hub->event_bits) &&
                    !connect_change)
                continue;

            ret = hub_port_status(hub, i,
                                  &portstatus, &portchange);
            if (ret < 0)
                continue;

            if (portchange & USB_PORT_STAT_C_CONNECTION) {
                clear_port_feature(hdev, i,
                                   USB_PORT_FEAT_C_CONNECTION);
                connect_change = 1;
            }

            if (portchange & USB_PORT_STAT_C_ENABLE) {
                if (!connect_change)
                    USB_debug("port %d enable change, status %08x\n", i, portstatus);
                clear_port_feature(hdev, i,
                                   USB_PORT_FEAT_C_ENABLE);

                /*
                 * EM interference sometimes causes badly
                 * shielded USB devices to be shutdown by
                 * the hub, this hack enables them again.
                 * Works at least with mouse driver.
                 */
                if (!(portstatus & USB_PORT_STAT_ENABLE)
                        && !connect_change
                        && hdev->children[i-1]) {
                    USB_error("port %i disabled by hub (EMI?), re-enabling...\n", i);
                    connect_change = 1;
                }
            }

            if (portchange & USB_PORT_STAT_C_SUSPEND) {
                struct usb_device *udev;

                clear_port_feature(hdev, i,
                                   USB_PORT_FEAT_C_SUSPEND);
                udev = hdev->children[i-1];
                if (udev) {
                    /* TRSMRCY = 10 msec */
                    msleep(10);

                    usb_lock_device(udev);
                    ret = usb_remote_wakeup(hdev->
                                            children[i-1]);
                    usb_unlock_device(udev);
                    if (ret < 0)
                        connect_change = 1;
                } else {
                    ret = -ENODEV;
                    hub_port_disable(hub, i, 1);
                }
                USB_debug("resume on port %d, status %d\n", i, ret);
            }

            if (portchange & USB_PORT_STAT_C_OVERCURRENT) {
                u16 status = 0;
                u16 unused;

                USB_debug("over-current change on port %d\n", i);
                clear_port_feature(hdev, i,
                                   USB_PORT_FEAT_C_OVER_CURRENT);
                msleep(100);    /* Cool down */
                hub_power_on(hub, true);
                hub_port_status(hub, i, &status, &unused);
                if (status & USB_PORT_STAT_OVERCURRENT)
                    USB_error("over-current condition on port %d\n", i);
            }

            if (portchange & USB_PORT_STAT_C_RESET) {
                USB_debug("reset change on port %d\n", i);
                clear_port_feature(hdev, i,
                                   USB_PORT_FEAT_C_RESET);
            }
            if ((portchange & USB_PORT_STAT_C_BH_RESET) &&
                    hub_is_superspeed(hub->hdev)) {
                USB_debug("warm reset change on port %d\n", i);
                clear_port_feature(hdev, i,
                                   USB_PORT_FEAT_C_BH_PORT_RESET);
            }
            if (portchange & USB_PORT_STAT_C_LINK_STATE) {
                clear_port_feature(hub->hdev, i,
                                   USB_PORT_FEAT_C_PORT_LINK_STATE);
            }
            if (portchange & USB_PORT_STAT_C_CONFIG_ERROR) {
                USB_error("config error on port %d\n", i);
                clear_port_feature(hub->hdev, i,
                                   USB_PORT_FEAT_C_PORT_CONFIG_ERROR);
            }

            /* Warm reset a USB3 protocol port if it's in
             * SS.Inactive state.
             */
            if (hub_is_superspeed(hub->hdev) &&
                    (portstatus & USB_PORT_STAT_LINK_STATE)
                    == USB_SS_PORT_LS_SS_INACTIVE) {
                USB_debug("warm reset port %d\n", i);
                hub_port_reset(hub, i, NULL,
                               HUB_BH_RESET_TIME, true);
            }

            if (connect_change) {
                hub_port_connect_change(hub, i, portstatus, portchange);
                has_event = 1;
            }
        } /* end for i */

