OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
        /* deal with hub status changes */
        if (test_and_clear_bit(0, hub->event_bits) == 0)
            ;   /* do nothing */
        else if (hub_hub_status(hub, &hubstatus, &hubchange) < 0)
            USB_error("get_hub_status failed\n");
        else {
            if (hubchange & HUB_CHANGE_LOCAL_POWER) {
                USB_debug("power change\n");
                clear_hub_feature(hdev, C_HUB_LOCAL_POWER);
                if (hubstatus & HUB_STATUS_LOCAL_POWER)
                    /* FIXME: Is this always true? */
                    hub->limited_power = 1;
                else
                    hub->limited_power = 0;
            }
            if (hubchange & HUB_CHANGE_OVERCURRENT) {
                u16 status = 0;
                u16 unused;

                USB_debug("over-current change\n");
                clear_hub_feature(hdev, C_HUB_OVER_CURRENT);
                msleep(500);    /* Cool down */
                hub_power_on(hub, true);
                hub_hub_status(hub, &status, &unused);
                if (status & HUB_STATUS_OVERCURRENT)
                    USB_error("over-current condition\n");
            }
        }

        // Nuvoton ported, single task; no while loop
        return has_event;   // has event

loop_autopm:
        /* Balance the usb_autopm_get_interface() above */
        usb_autopm_put_interface_no_suspend(intf);
loop:
        /* Balance the usb_autopm_get_interface_no_resume() in
         * kick_khubd() and allow autosuspend.
         */
        usb_autopm_put_interface(intf);
loop_disconnected:
        usb_unlock_device(hdev);
        // kref_put(&hub->kref, hub_release);
        hub->kref--;
        if (hub->kref == 0)
            hub_release(hub);

    } /* end while (1) */
    return has_event;   // has event
}

#if 1   // Nvoton ported
void hub_thread(void)
{
    hub_events();
}

#else
static int hub_thread(void *__unused)
{
    /* khubd needs to be freezable to avoid intefering with USB-PERSIST
     * port handover.  Otherwise it might see that a full-speed device
     * was gone before the EHCI controller had handed its port over to
     * the companion full-speed controller.
     */
    set_freezable();

    do {
        hub_events();
        wait_event_freezable(khubd_wait,
                             !list_empty(&hub_event_list) ||
                             kthread_should_stop());
    } while (!kthread_should_stop() || !list_empty(&hub_event_list));

    pr_debug("%s: khubd exiting\n", usbcore_name);
    return 0;
}
#endif

static const struct usb_device_id hub_id_table[] = {
    { USB_DEVICE_ID_MATCH_DEV_CLASS, 0,0,0,0, USB_CLASS_HUB, 0,0,0,0,0,0 },
    { USB_DEVICE_ID_MATCH_INT_CLASS, 0,0,0,0,0,0,0, USB_CLASS_HUB, 0,0,0 },
    { 0,0,0,0,0,0,0,0,0,0,0,0 }                     /* Terminating entry */
};

//MODULE_DEVICE_TABLE (usb, hub_id_table);

#if 1
static struct usb_driver hub_driver = {
    "hub",
    hub_probe,
    hub_disconnect,
    hub_suspend,
    hub_resume,
    hub_reset_resume,
    hub_pre_reset,
    hub_post_reset,
    hub_id_table
//  {},
//  {},
//  1
};
#else
static struct usb_driver hub_driver = {
    .name =     "hub",
    .probe =    hub_probe,
    .disconnect =   hub_disconnect,
    .suspend =  hub_suspend,
    .resume =   hub_resume,
    .reset_resume = hub_reset_resume,
    .pre_reset =    hub_pre_reset,
    .post_reset =   hub_post_reset,
    .unlocked_ioctl = hub_ioctl,
    .id_table = hub_id_table,
    .supports_autosuspend = 1,
};
#endif

int usb_hub_init(void)
{
    //if (usb_register(&hub_driver) < 0) {
    if (usb_register_driver(&hub_driver, "hub driver") < 0) {
        USB_error("Can't register hub driver\n");
        return -1;
    }

#if 0
    khubd_task = kthread_run(hub_thread, NULL, "khubd");
    if (!IS_ERR(khubd_task))
        return 0;

    /* Fall through if kernel_thread failed */
    usb_deregister(&hub_driver);
    printk(KERN_ERR "%s: can't start khubd\n", usbcore_name);

    return -1;
#endif
    return 0;
}

void usb_hub_cleanup(void)
{
    //kthread_stop(khubd_task);

    /*
     * Hub resources are freed for us by usb_deregister. It calls
     * usb_driver_purge on every device which in turn calls that
     * devices disconnect function if it is using this driver.
     * The hub_disconnect function takes care of releasing the
     * individual hub resources. -greg
     */
    usb_deregister(&hub_driver);
} /* usb_hub_cleanup() */

static int descriptors_changed(struct usb_device *udev,
                               struct usb_device_descriptor *old_device_descriptor)
{
    int     changed = 0;
    unsigned    index;
    unsigned    serial_len = 0;
    unsigned    len;
    unsigned    old_length;
    int     length;
    char        *buf;

    if (memcmp(&udev->descriptor, old_device_descriptor,
               sizeof(*old_device_descriptor)) != 0)
        return 1;

    /* Since the idVendor, idProduct, and bcdDevice values in the
     * device descriptor haven't changed, we will assume the
     * Manufacturer and Product strings haven't changed either.
     * But the SerialNumber string could be different (e.g., a
     * different flash card of the same brand).
     */
    if (udev->serial)
        serial_len = strlen(udev->serial) + 1;

    len = serial_len;
    for (index = 0; index < udev->descriptor.bNumConfigurations; index++) {
        old_length = le16_to_cpu(udev->config[index].desc.wTotalLength);
        len = max(len, old_length);
    }

    buf = kmalloc(len, GFP_NOIO);
    if (buf == NULL) {
        USB_error("no mem to re-read configs after reset\n");
        /* assume the worst */
        return 1;
    }
    for (index = 0; index < udev->descriptor.bNumConfigurations; index++) {
        old_length = le16_to_cpu(udev->config[index].desc.wTotalLength);
        length = usb_get_descriptor(udev, USB_DT_CONFIG, index, buf,
                                    old_length);
        if (length != old_length) {
            USB_debug("config index %d, error %d\n", index, length);
            changed = 1;
            break;
        }
        if (memcmp (buf, udev->rawdescriptors[index], old_length)
                != 0) {
            USB_debug("config index %d changed (#%d)\n", index,
                      ((struct usb_config_descriptor *) buf)->bConfigurationValue);
            changed = 1;
            break;
        }
    }

