OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
    if (!changed && serial_len) {
        length = usb_string(udev, udev->descriptor.iSerialNumber,
                            buf, serial_len);
        if (length + 1 != serial_len) {
            USB_debug("serial string error %d\n", length);
            changed = 1;
        } else if (memcmp(buf, udev->serial, length) != 0) {
            USB_debug("serial string changed\n");
            changed = 1;
        }
    }

    kfree(buf);
    return changed;
}

/**
 * usb_reset_and_verify_device - perform a USB port reset to reinitialize a device
 * @udev: device to reset (not in SUSPENDED or NOTATTACHED state)
 *
 * WARNING - don't use this routine to reset a composite device
 * (one with multiple interfaces owned by separate drivers)!
 * Use usb_reset_device() instead.
 *
 * Do a port reset, reassign the device's address, and establish its
 * former operating configuration.  If the reset fails, or the device's
 * descriptors change from their values before the reset, or the original
 * configuration and altsettings cannot be restored, a flag will be set
 * telling khubd to pretend the device has been disconnected and then
 * re-connected.  All drivers will be unbound, and the device will be
 * re-enumerated and probed all over again.
 *
 * Returns 0 if the reset succeeded, -ENODEV if the device has been
 * flagged for logical disconnection, or some other negative error code
 * if the reset wasn't even attempted.
 *
 * The caller must own the device lock.  For example, it's safe to use
 * this from a driver probe() routine after downloading new firmware.
 * For calls that might not occur during probe(), drivers should lock
 * the device using usb_lock_device_for_reset().
 *
 * Locking exception: This routine may also be called from within an
 * autoresume handler.  Such usage won't conflict with other tasks
 * holding the device lock because these tasks should always call
 * usb_autopm_resume_device(), thereby preventing any unwanted autoresume.
 */
static int usb_reset_and_verify_device(struct usb_device *udev)
{
    struct usb_device       *parent_hdev = udev->parent;
    struct usb_hub          *parent_hub;
    //struct usb_hcd            *hcd = bus_to_hcd(udev->bus);
    struct usb_device_descriptor    descriptor = udev->descriptor;
    int                 i, ret = 0;
    int             port1 = udev->portnum;

    if (udev->state == USB_STATE_NOTATTACHED ||
            udev->state == USB_STATE_SUSPENDED) {
        USB_debug("device reset not allowed in state %d\n", udev->state);
        return -EINVAL;
    }

    if (!parent_hdev) {
        /* this requires hcd-specific logic; see ohci_restart() */
        USB_debug("%s for root hub!\n", __func__);
        return -EISDIR;
    }
    parent_hub = hdev_to_hub(parent_hdev);

    set_bit(port1, parent_hub->busy_bits);
    for (i = 0; i < SET_CONFIG_TRIES; ++i) {

        /* ep0 maxpacket size may change; let the HCD know about it.
         * Other endpoints will be handled by re-enumeration. */
        usb_ep0_reinit(udev);
        ret = hub_port_init(parent_hub, udev, port1, i);
        if (ret >= 0 || ret == -ENOTCONN || ret == -ENODEV)
            break;
    }
    clear_bit(port1, parent_hub->busy_bits);

    if (ret < 0)
        goto re_enumerate;

    /* Device might have changed firmware (DFU or similar) */
    if (descriptors_changed(udev, &descriptor)) {
        USB_debug("device firmware changed\n");
        udev->descriptor = descriptor;  /* for disconnect() calls */
        goto re_enumerate;
    }

    /* Restore the device's previous configuration */
    if (!udev->actconfig)
        goto done;

    mutex_lock(hcd->bandwidth_mutex);
    ret = usb_hcd_alloc_bandwidth(udev, udev->actconfig, NULL, NULL);
    if (ret < 0) {
        USB_error("Busted HC?  Not enough HCD resources for old configuration.\n");
        mutex_unlock(hcd->bandwidth_mutex);
        goto re_enumerate;
    }

    ret = usb_control_msg(udev, usb_sndctrlpipe(udev, 0),
                          USB_REQ_SET_CONFIGURATION, 0,
                          udev->actconfig->desc.bConfigurationValue, 0,
                          NULL, 0, USB_CTRL_SET_TIMEOUT);

    if (ret < 0) {
        USB_error("can't restore configuration #%d (error=%d)\n",
                  udev->actconfig->desc.bConfigurationValue, ret);
        mutex_unlock(hcd->bandwidth_mutex);
        goto re_enumerate;
    }
    mutex_unlock(hcd->bandwidth_mutex);
    usb_set_device_state(udev, USB_STATE_CONFIGURED);

    /* Put interfaces back into the same altsettings as before.
     * Don't bother to send the Set-Interface request for interfaces
     * that were already in altsetting 0; besides being unnecessary,
     * many devices can't handle it.  Instead just reset the host-side
     * endpoint state.
     */
    for (i = 0; i < udev->actconfig->desc.bNumInterfaces; i++) {
        struct usb_host_config *config = udev->actconfig;
        struct usb_interface *intf = config->interface[i];
        struct usb_interface_descriptor *desc;

        desc = &intf->cur_altsetting->desc;
        if (desc->bAlternateSetting == 0) {
            usb_disable_interface(udev, intf, true);
            usb_enable_interface(udev, intf, true);
            ret = 0;
        } else {
            /* Let the bandwidth allocation function know that this
             * device has been reset, and it will have to use
             * alternate setting 0 as the current alternate setting.
             */
            intf->resetting_device = 1;
            ret = usb_set_interface(udev, desc->bInterfaceNumber,
                                    desc->bAlternateSetting);
            intf->resetting_device = 0;
        }
        if (ret < 0) {
            USB_error("failed to restore interface %d altsetting %d (error=%d)\n",
                      desc->bInterfaceNumber, desc->bAlternateSetting, ret);
            goto re_enumerate;
        }
    }

done:
    return 0;

re_enumerate:
    hub_port_logical_disconnect(parent_hub, port1);
    return -ENODEV;
}

/**
 * usb_reset_device - warn interface drivers and perform a USB port reset
 * @udev: device to reset (not in SUSPENDED or NOTATTACHED state)
 *
 * Warns all drivers bound to registered interfaces (using their pre_reset
 * method), performs the port reset, and then lets the drivers know that
 * the reset is over (using their post_reset method).
 *
 * Return value is the same as for usb_reset_and_verify_device().
 *
 * The caller must own the device lock.  For example, it's safe to use
 * this from a driver probe() routine after downloading new firmware.
 * For calls that might not occur during probe(), drivers should lock
 * the device using usb_lock_device_for_reset().
 *
 * If an interface is currently being probed or disconnected, we assume
 * its driver knows how to handle resets.  For all other interfaces,
 * if the driver doesn't have pre_reset and post_reset methods then
 * we attempt to unbind it and rebind afterward.
 */
int usb_reset_device(struct usb_device *udev)
{
    int ret;
    int i;
    struct usb_host_config *config = udev->actconfig;

