OpenNuvoton/M480BSP/Library/USB_Host/src_core/hub.c
    if (udev->state == USB_STATE_NOTATTACHED ||
            udev->state == USB_STATE_SUSPENDED) {
        USB_debug("device reset not allowed in state %d\n", udev->state);
        return -EINVAL;
    }

    /* Prevent autosuspend during the reset */
    usb_autoresume_device(udev);

    if (config) {
        for (i = 0; i < config->desc.bNumInterfaces; ++i) {
            struct usb_interface *cintf = config->interface[i];
            struct usb_driver *drv;
            int unbind = 0;

            if (cintf->dev.driver) {
                drv = to_usb_driver_by_devdrv(cintf->dev.driver);   //  to_usb_driver(cintf->dev.driver);
                if (drv->pre_reset && drv->post_reset)
                    unbind = (drv->pre_reset)(cintf);
                else if (cintf->condition ==
                         USB_INTERFACE_BOUND)
                    unbind = 1;
                if (unbind)
                    usb_forced_unbind_intf(cintf);
            }
        }
    }

    ret = usb_reset_and_verify_device(udev);

    if (config) {
        for (i = config->desc.bNumInterfaces - 1; i >= 0; --i) {
            struct usb_interface *cintf = config->interface[i];
            struct usb_driver *drv;
            int rebind = cintf->needs_binding;

            if (!rebind && cintf->dev.driver) {
                drv = to_usb_driver_by_devdrv(cintf->dev.driver);   // to_usb_driver(cintf->dev.driver);
                if (drv->post_reset)
                    rebind = (drv->post_reset)(cintf);
                else if (cintf->condition ==
                         USB_INTERFACE_BOUND)
                    rebind = 1;
            }
            if (ret == 0 && rebind)
                usb_rebind_intf(cintf);
        }
    }

    usb_autosuspend_device(udev);
    return ret;
}


/**
 * usb_queue_reset_device - Reset a USB device from an atomic context
 * @iface: USB interface belonging to the device to reset
 *
 * This function can be used to reset a USB device from an atomic
 * context, where usb_reset_device() won't work (as it blocks).
 *
 * Doing a reset via this method is functionally equivalent to calling
 * usb_reset_device(), except for the fact that it is delayed to a
 * workqueue. This means that any drivers bound to other interfaces
 * might be unbound, as well as users from usbfs in user space.
 *
 * Corner cases:
 *
 * - Scheduling two resets at the same time from two different drivers
 *   attached to two different interfaces of the same device is
 *   possible; depending on how the driver attached to each interface
 *   handles ->pre_reset(), the second reset might happen or not.
 *
 * - If a driver is unbound and it had a pending reset, the reset will
 *   be cancelled.
 *
 * - This function can be called during .probe() or .disconnect()
 *   times. On return from .disconnect(), any pending resets will be
 *   cancelled.
 *
 * There is no no need to lock/unlock the @reset_ws as schedule_work()
 * does its own.
 *
 * NOTE: We don't do any reference count tracking because it is not
 *     needed. The lifecycle of the work_struct is tied to the
 *     usb_interface. Before destroying the interface we cancel the
 *     work_struct, so the fact that work_struct is queued and or
 *     running means the interface (and thus, the device) exist and
 *     are referenced.
 */
#if 0
void usb_queue_reset_device(struct usb_interface *iface)
{
    schedule_work(&iface->reset_ws);
}
#endif


/// @endcond HIDDEN_SYMBOLS

